[
    {
      "id": 1,
      "company_name": "DEVNET",
      "company_description": "DEVNET is a privately held company that was founded in 1997 on the principles of providing integrated software and hardware solutions to local government. DEVNET has provided dynamic and flexible Appraisal, Assessment, Collections and Online Inquiry solutions to local government for over 24 years. The DEVNET products, services and customer experiences have proven positive as DEVNET currently serves over 130 jurisdictions spanning the United States.",
      "position_title": "Database Administrator",
      "job_type": "Full Time",
      "location": "Hybrid remote in Chattanooga, TN",
      "position_summary": "DEVNET is looking for an experienced Database Administrator (DBA) to manage and maintain our organization's database systems. The ideal candidate will be responsible for ensuring the performance, availability, and security of databases, as well as overseeing database backups, recoveries, and upgrades. The DBA will work closely with the development team to optimize query performance and maintain efficient database operations.",
      "primary_responsibilities": [
        "Database Management: Oversee the installation, configuration, and maintenance of database systems (e.g., SQL Server, Oracle, MySQL, PostgreSQL).",
        "Performance Tuning: Monitor database performance, identify bottlenecks, and optimize SQL queries and database structures to ensure high availability and performance.",
        "Backup & Recovery: Design and implement effective database backup and recovery strategies. Ensure database systems can be restored quickly in the event of data loss.",
        "Security: Implement and maintain database security policies, manage user permissions, and monitor access to ensure data is protected from unauthorized use or breaches.",
        "Upgrades & Patching: Perform regular database updates, patching, and migrations to ensure systems remain up to date and secure.",
        "Capacity Planning: Monitor and manage database storage, including planning for future growth and system resource requirements.",
        "Documentation: Maintain detailed documentation of database configurations, procedures, and processes.",
        "Collaboration: Work closely with developers, system administrators, and other IT staff to support database-related projects and troubleshoot issues.",
        "Automation: Develop scripts and tools to automate routine database tasks and improve operational efficiency."
      ],
      "requirements": [
        "Experience: Minimum 3-5 years of experience as a Database Administrator, managing large-scale databases in a production environment. Use of Visual Studios and SSIS packages as a tool for data migration.",
        "Database Systems: In-depth knowledge of SQL databases (e.g., SQL Server, MySQL, PostgreSQL) and experience with both relational and NoSQL databases.",
        "Performance Optimization: Strong understanding of database optimization, indexing, query tuning, and data modeling.",
        "Backup & Recovery: Expertise in implementing and managing backup, recovery, and disaster recovery processes.",
        "Security: Proficiency in database security, encryption, and access control mechanisms.",
        "Scripting: Knowledge of database scripting languages (e.g., SQL, PL/SQL, T-SQL) and familiarity with automation tools (e.g., PowerShell, Python)."
      ],
      "benefits": [
        "Remote work environment and competitive salary",
        "Excellent benefit package including Medical and Dental",
        "Vacation and sick time",
        "401(K) Plan"
      ],
      "salary_min": 85529,
      "salary_max": 89353,
      "relocation_required": "Relocate to Chattanooga, TN before starting work"
    },
    {
      "id": 2,
      "company_name": "Sunrise Café & Bakery",
      "company_description": "Sunrise Café & Bakery is a family-owned neighborhood café established in 2015, serving fresh-baked goods and locally-sourced breakfast and lunch items. We pride ourselves on creating a warm, welcoming atmosphere for our community.",
      "position_title": "Barista",
      "job_type": "Part Time",
      "location": "On-site in Portland, OR",
      "position_summary": "We're seeking an enthusiastic and friendly Barista to join our morning team. You'll be responsible for crafting excellent coffee drinks, providing outstanding customer service, and maintaining a clean work environment.",
      "primary_responsibilities": [
        "Prepare and serve espresso-based beverages, drip coffee, and specialty drinks according to recipes",
        "Take customer orders and operate cash register and point-of-sale system",
        "Maintain cleanliness of work area, equipment, and dining space",
        "Restock supplies, ingredients, and merchandise as needed",
        "Provide friendly, prompt service and handle customer inquiries",
        "Follow all food safety and sanitation guidelines",
        "Assist with opening or closing procedures as assigned"
      ],
      "requirements": [
        "No prior experience required; barista training provided",
        "Ability to work early morning shifts starting at 5:30 AM",
        "Strong communication and customer service skills",
        "Ability to stand for extended periods and lift up to 25 lbs",
        "Weekend availability required",
        "Must be at least 16 years of age"
      ],
      "benefits": [
        "Free drinks during shifts",
        "50% employee discount on food items",
        "Flexible scheduling",
        "Tips"
      ],
      "salary_min": 15.50,
      "salary_max": 17.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 3,
      "company_name": "MedTech Solutions",
      "company_description": "MedTech Solutions is a leading medical device manufacturer specializing in surgical instruments and diagnostic equipment. With over 2,000 employees worldwide and annual revenue exceeding $500 million, we're committed to advancing healthcare through innovation.",
      "position_title": "Senior Quality Assurance Engineer",
      "job_type": "Full Time",
      "location": "On-site in Minneapolis, MN",
      "position_summary": "MedTech Solutions is seeking a Senior Quality Assurance Engineer to lead quality initiatives for our new line of diagnostic imaging equipment. The successful candidate will ensure compliance with FDA regulations, ISO standards, and internal quality systems while driving continuous improvement initiatives.",
      "primary_responsibilities": [
        "Develop and implement quality assurance protocols for medical device manufacturing",
        "Lead Design Control activities including risk management, verification, and validation",
        "Conduct internal audits and manage external regulatory audits (FDA, ISO 13485)",
        "Investigate non-conformances, CAPAs, and customer complaints",
        "Review and approve design documentation, validation protocols, and technical files",
        "Mentor junior QA staff and provide training on regulatory requirements",
        "Collaborate with R&D, Manufacturing, and Regulatory Affairs on product launches",
        "Manage supplier quality and perform supplier audits",
        "Maintain quality management system documentation and procedures"
      ],
      "requirements": [
        "Bachelor's degree in Engineering, Life Sciences, or related field; Master's preferred",
        "7+ years of experience in medical device quality assurance",
        "Expert knowledge of FDA 21 CFR Part 820, ISO 13485, and ISO 14971",
        "Experience with Class II or Class III medical devices required",
        "ASQ Certified Quality Engineer (CQE) or similar certification preferred",
        "Strong understanding of Design Controls and risk management processes",
        "Experience leading regulatory audits and inspections",
        "Excellent analytical, problem-solving, and communication skills",
        "Proficiency with quality management software systems"
      ],
      "benefits": [
        "Comprehensive health, dental, and vision insurance",
        "401(k) with 6% company match",
        "4 weeks PTO plus 10 paid holidays",
        "Tuition reimbursement up to $8,000 annually",
        "Professional development opportunities",
        "On-site fitness center and wellness programs",
        "Life and disability insurance",
        "Employee stock purchase plan"
      ],
      "salary_min": 95000,
      "salary_max": 125000,
      "pay_period": "Annual",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 4,
      "company_name": "GreenThumb Landscaping",
      "company_description": "GreenThumb Landscaping is a small, locally-owned business serving residential and commercial clients in the greater Phoenix area for over 15 years. We specialize in desert landscaping, lawn maintenance, and irrigation systems.",
      "position_title": "Landscape Crew Member",
      "job_type": "Seasonal Full Time",
      "location": "On-site in Phoenix, AZ",
      "position_summary": "We're hiring landscape crew members for our busy spring and summer season. You'll work outdoors as part of a team maintaining lawns, gardens, and landscapes for our valued clients.",
      "primary_responsibilities": [
        "Mow, edge, and trim lawns using commercial equipment",
        "Plant flowers, shrubs, and trees",
        "Apply mulch and perform weeding",
        "Operate and maintain landscaping equipment safely",
        "Perform basic irrigation system maintenance and repairs",
        "Load and unload materials and equipment from trucks",
        "Follow crew leader instructions and work efficiently as a team",
        "Maintain clean and organized work vehicles"
      ],
      "requirements": [
        "No experience required; will train motivated individuals",
        "Valid driver's license preferred but not required",
        "Ability to work outdoors in hot weather (temperatures exceeding 110°F)",
        "Ability to lift and carry 50+ lbs regularly",
        "Bilingual (English/Spanish) a plus",
        "Reliable transportation to shop location",
        "Must pass background check"
      ],
      "benefits": [
        "Weekly pay",
        "Overtime opportunities",
        "Potential for year-round employment for top performers",
        "On-the-job training"
      ],
      "salary_min": 16.00,
      "salary_max": 18.50,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 5,
      "company_name": "Axiom Capital Partners",
      "company_description": "Axiom Capital Partners is a premier investment banking firm headquartered in New York City, specializing in mergers and acquisitions, capital raising, and strategic advisory services for middle-market companies. Founded in 2005, we've completed over $15 billion in transactions across diverse industries.",
      "position_title": "Managing Director - Healthcare Investment Banking",
      "job_type": "Full Time",
      "location": "On-site in New York, NY",
      "position_summary": "Axiom Capital Partners is seeking an exceptional Managing Director to lead and expand our Healthcare Investment Banking practice. This role demands a proven rainmaker with extensive industry relationships, transaction experience, and the ability to mentor and develop junior bankers while driving significant revenue growth.",
      "primary_responsibilities": [
        "Originate and execute M&A transactions, capital raises, and strategic advisory engagements in the healthcare sector",
        "Develop and maintain C-level relationships with healthcare companies, private equity firms, and strategic buyers",
        "Lead deal teams through all phases of transactions from origination to closing",
        "Provide strategic counsel to clients on market positioning, valuation, and transaction strategy",
        "Identify and pursue new business opportunities and market segments",
        "Oversee financial modeling, valuation analysis, and due diligence processes",
        "Present investment opportunities and strategic recommendations to boards and executive teams",
        "Mentor Vice Presidents, Associates, and Analysts in technical and client management skills",
        "Represent the firm at industry conferences and events",
        "Contribute to firm-wide strategic planning and business development initiatives"
      ],
      "requirements": [
        "MBA from top-tier business school required",
        "15+ years of investment banking experience with at least 8 years focused on healthcare",
        "Proven track record of originating and closing transactions totaling $100M+",
        "Extensive network of relationships within healthcare industry and private equity community",
        "Deep knowledge of healthcare subsectors including: providers, payers, services, and technology",
        "Outstanding financial modeling, valuation, and analytical skills",
        "Series 79 and 63 licenses required or ability to obtain within 6 months",
        "Exceptional presentation and communication skills",
        "Demonstrated leadership and team management abilities",
        "Willingness to travel extensively (50%+)"
      ],
      "benefits": [
        "Base salary plus significant performance-based bonus (total compensation potential $500K-$2M+)",
        "Carried interest participation in firm transactions",
        "Comprehensive platinum-level health benefits",
        "401(k) with profit sharing",
        "Unlimited PTO policy",
        "Executive coaching and professional development",
        "Annual membership to professional organization of choice",
        "Car allowance",
        "Relocation package available"
      ],
      "salary_min": 300000,
      "salary_max": 450000,
      "pay_period": "Annual",
      "bonus_potential": "Performance-based bonus typically 100-400% of base",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 6,
      "company_name": "Lincoln County School District",
      "company_description": "Lincoln County School District serves approximately 8,500 students across 14 schools in rural Nebraska. Our mission is to provide high-quality education that prepares all students for success in college, career, and life.",
      "position_title": "Elementary School Teacher - 3rd Grade",
      "job_type": "Full Time",
      "location": "On-site in North Platte, NE",
      "position_summary": "Lincoln County School District is seeking a dedicated and enthusiastic Elementary School Teacher for 3rd grade at Washington Elementary School. The ideal candidate will create an engaging learning environment that supports the academic, social, and emotional development of all students.",
      "primary_responsibilities": [
        "Plan and deliver standards-based instruction in all core subjects (reading, writing, mathematics, science, social studies)",
        "Differentiate instruction to meet diverse learning needs and abilities",
        "Assess student progress and maintain accurate records of academic performance",
        "Create a positive, inclusive classroom culture that promotes respect and responsibility",
        "Communicate regularly with parents regarding student progress and concerns",
        "Collaborate with grade-level team, special education staff, and support personnel",
        "Attend faculty meetings, professional development sessions, and school events",
        "Supervise students during lunch, recess, and arrival/dismissal",
        "Participate in IEP meetings and implement accommodation plans",
        "Maintain organized classroom and instructional materials"
      ],
      "requirements": [
        "Bachelor's degree in Elementary Education required; Master's preferred",
        "Valid Nebraska Teaching Certificate with Elementary Education endorsement",
        "Student teaching or classroom experience with elementary-aged children",
        "Knowledge of literacy and mathematics instructional best practices",
        "Familiarity with assessment tools and data-driven instruction",
        "Strong classroom management skills",
        "Excellent interpersonal and communication abilities",
        "Proficiency with educational technology and Google Classroom",
        "CPR and First Aid certification (or willingness to obtain)",
        "Background check and fingerprinting required"
      ],
      "benefits": [
        "Competitive salary based on education and experience (district salary schedule)",
        "Comprehensive health insurance with district contribution",
        "Dental and vision insurance options",
        "Retirement plan through Nebraska Public Employees Retirement System",
        "Professional development opportunities and tuition reimbursement",
        "10 sick days and 2 personal days annually",
        "Paid winter and spring breaks",
        "Collaborative and supportive work environment"
      ],
      "salary_min": 41000,
      "salary_max": 52000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 7,
      "company_name": "TechStart Innovations",
      "company_description": "TechStart Innovations is a fast-growing startup developing AI-powered tools for small businesses. Founded in 2022, we've raised $12M in Series A funding and are scaling rapidly to meet market demand.",
      "position_title": "Full Stack Software Engineer",
      "job_type": "Full Time",
      "location": "Remote (US only)",
      "position_summary": "TechStart is looking for a talented Full Stack Software Engineer to help build and scale our SaaS platform. You'll work directly with our CTO and product team in a fast-paced startup environment where your contributions will have immediate impact.",
      "primary_responsibilities": [
        "Design, develop, and deploy features across our web application stack",
        "Build responsive front-end interfaces using React and TypeScript",
        "Develop RESTful APIs and backend services using Node.js and Python",
        "Implement and optimize database schemas in PostgreSQL",
        "Write clean, maintainable code with comprehensive test coverage",
        "Participate in code reviews and provide constructive feedback",
        "Troubleshoot production issues and implement solutions quickly",
        "Collaborate with designers, product managers, and other engineers",
        "Contribute to architecture decisions and technical roadmap planning"
      ],
      "requirements": [
        "2-4 years of professional software development experience",
        "Strong proficiency in JavaScript/TypeScript and React",
        "Experience with Node.js and building RESTful APIs",
        "Solid understanding of relational databases (PostgreSQL preferred)",
        "Familiarity with cloud platforms (AWS, GCP, or Azure)",
        "Experience with Git version control and CI/CD pipelines",
        "Understanding of web security best practices",
        "Excellent problem-solving and debugging skills",
        "Strong communication skills and collaborative mindset",
        "Bachelor's degree in Computer Science or equivalent experience"
      ],
      "benefits": [
        "Competitive salary plus equity (0.1% - 0.5%)",
        "Fully remote work with flexible hours",
        "Health, dental, and vision insurance (100% premium covered)",
        "401(k) with 4% match",
        "Unlimited PTO (minimum 3 weeks encouraged)",
        "$1,500 annual learning and development budget",
        "Home office stipend ($500)",
        "Latest MacBook Pro and equipment",
        "Quarterly team retreats"
      ],
      "salary_min": 110000,
      "salary_max": 145000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 8,
      "company_name": "Mountain View Retirement Community",
      "company_description": "Mountain View Retirement Community is a premier senior living facility offering assisted living and memory care services. Located on a beautiful 15-acre campus, we provide compassionate care in a homelike environment for 120 residents.",
      "position_title": "Certified Nursing Assistant (CNA) - Night Shift",
      "job_type": "Full Time",
      "location": "On-site in Asheville, NC",
      "position_summary": "Mountain View is seeking compassionate CNAs for our night shift (11pm-7am). You'll provide direct care to residents, helping with activities of daily living and ensuring their comfort and safety during overnight hours.",
      "primary_responsibilities": [
        "Assist residents with bathing, dressing, grooming, and toileting",
        "Help residents with mobility and transfers using proper body mechanics",
        "Monitor and record vital signs, intake/output, and changes in condition",
        "Provide assistance with eating and feeding as needed",
        "Respond to call lights promptly and address resident needs",
        "Turn and reposition residents to prevent pressure sores",
        "Maintain clean and safe resident rooms and common areas",
        "Document care provided in electronic health record system",
        "Communicate effectively with nurses and other care team members",
        "Treat all residents with dignity, respect, and compassion"
      ],
      "requirements": [
        "Active North Carolina CNA certification required",
        "CPR certification (or willingness to obtain)",
        "Previous experience in long-term care preferred but not required",
        "Ability to lift and transfer residents (up to 50 lbs)",
        "Strong interpersonal and communication skills",
        "Patience and compassion when working with elderly and memory care residents",
        "Reliable attendance and punctuality",
        "Ability to work every other weekend",
        "High school diploma or equivalent",
        "Must pass background check and drug screening"
      ],
      "benefits": [
        "Night shift differential ($2.50/hour additional)",
        "Health, dental, and vision insurance",
        "401(k) retirement plan",
        "Paid time off and holiday pay",
        "Continuing education opportunities and tuition assistance",
        "Employee referral bonuses",
        "Free meals during shifts",
        "Supportive team environment"
      ],
      "salary_min": 16.50,
      "salary_max": 19.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 9,
      "company_name": "Apex Marketing Group",
      "company_description": "Apex Marketing Group is a full-service digital marketing agency serving clients across North America. Our 50-person team specializes in SEO, content marketing, paid advertising, and social media management.",
      "position_title": "Marketing Coordinator",
      "job_type": "Full Time",
      "location": "Hybrid in Austin, TX (3 days in office)",
      "position_summary": "Apex Marketing Group is seeking an organized and detail-oriented Marketing Coordinator to support our client services team. This role is ideal for someone with 1-2 years of marketing experience looking to grow their skills in a dynamic agency environment.",
      "primary_responsibilities": [
        "Coordinate campaign logistics and timelines across multiple client accounts",
        "Schedule and manage social media content using Hootsuite and Buffer",
        "Draft blog posts, email newsletters, and social media copy",
        "Assist with creation of client reports and performance presentations",
        "Conduct market research and competitive analysis",
        "Maintain marketing calendars and project management systems (Asana)",
        "Coordinate with designers, writers, and account managers on deliverables",
        "Monitor campaign performance metrics and compile data",
        "Provide administrative support for client meetings and presentations",
        "Stay current on digital marketing trends and best practices"
      ],
      "requirements": [
        "Bachelor's degree in Marketing, Communications, or related field",
        "1-2 years of marketing or agency experience",
        "Strong writing and editing skills with attention to detail",
        "Familiarity with social media platforms and management tools",
        "Basic understanding of SEO and Google Analytics",
        "Proficiency in Microsoft Office and Google Workspace",
        "Experience with project management tools (Asana, Trello, or Monday.com)",
        "Excellent organizational and time management skills",
        "Ability to juggle multiple projects and meet deadlines",
        "Positive attitude and willingness to learn"
      ],
      "benefits": [
        "Health and dental insurance",
        "401(k) plan",
        "15 days PTO plus major holidays",
        "Professional development budget",
        "Hybrid work schedule",
        "Casual dress code",
        "Team lunches and social events",
        "Modern downtown office location"
      ],
      "salary_min": 45000,
      "salary_max": 52000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 10,
      "company_name": "Golden State Construction",
      "company_description": "Golden State Construction is a commercial general contractor specializing in retail, office, and industrial projects throughout California. With 200+ employees and 30 years in business, we're known for quality workmanship and safety excellence.",
      "position_title": "Project Manager - Commercial Construction",
      "job_type": "Full Time",
      "location": "On-site in Sacramento, CA",
      "position_summary": "Golden State Construction seeks an experienced Project Manager to oversee commercial construction projects from pre-construction through closeout. You'll manage project budgets of $5M-$20M, coordinate subcontractors, and ensure projects are completed on time, within budget, and to quality standards.",
      "primary_responsibilities": [
        "Manage all phases of commercial construction projects from start to finish",
        "Develop and maintain project schedules using Primavera P6 or MS Project",
        "Prepare and manage project budgets, cost reports, and change orders",
        "Coordinate and supervise subcontractors, vendors, and field staff",
        "Conduct regular site visits to monitor progress and ensure quality",
        "Review and approve submittals, RFIs, and shop drawings",
        "Manage client relationships and conduct regular project meetings",
        "Ensure compliance with building codes, safety regulations, and contract documents",
        "Negotiate and manage subcontractor agreements and purchase orders",
        "Resolve project issues and coordinate solutions with design team and owner",
        "Track and document all project correspondence and records",
        "Conduct project closeout including punch lists and final documentation"
      ],
      "requirements": [
        "Bachelor's degree in Construction Management, Engineering, or related field",
        "5+ years of experience managing commercial construction projects",
        "Proven track record managing projects $5M+ in value",
        "Strong knowledge of commercial construction methods, materials, and building codes",
        "Proficiency with project management software (Procore, Primavera, MS Project)",
        "Excellent understanding of construction documents and specifications",
        "Strong leadership, communication, and problem-solving skills",
        "Ability to read and interpret blueprints and construction drawings",
        "Valid driver's license and reliable transportation",
        "OSHA 30 certification preferred",
        "PMP certification a plus"
      ],
      "benefits": [
        "Competitive salary based on experience",
        "Company vehicle or car allowance",
        "Performance-based bonuses",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with company match",
        "3 weeks PTO plus paid holidays",
        "Professional development and training opportunities",
        "Cell phone and laptop provided",
        "Paid professional memberships"
      ],
      "salary_min": 95000,
      "salary_max": 130000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 11,
      "company_name": "Riverside Books",
      "company_description": "Riverside Books is an independent bookstore and community gathering space in downtown Charleston. For 25 years, we've been connecting readers with books and hosting author events, book clubs, and writing workshops.",
      "position_title": "Bookseller",
      "job_type": "Part Time",
      "location": "On-site in Charleston, SC",
      "position_summary": "We're looking for book-loving individuals to join our team as Booksellers. You'll help customers discover their next great read, process sales, maintain store displays, and contribute to the vibrant literary community we've built.",
      "primary_responsibilities": [
        "Provide personalized book recommendations to customers based on their interests",
        "Process customer purchases and returns using POS system",
        "Stock shelves and create attractive book displays",
        "Assist with receiving and processing new inventory",
        "Maintain organized and tidy sales floor",
        "Answer phone inquiries and take special orders",
        "Help coordinate and set up author events and book clubs",
        "Stay current on new releases and bestsellers across genres",
        "Engage customers in friendly conversation about books and reading"
      ],
      "requirements": [
        "Passion for books and reading across multiple genres",
        "Strong customer service skills and friendly demeanor",
        "Ability to make thoughtful book recommendations",
        "Retail or customer service experience preferred",
        "Ability to lift and carry books (up to 30 lbs)",
        "Comfortable with computer systems and learning POS software",
        "Availability to work weekends and some evenings",
        "Reliable and punctual",
        "High school diploma or equivalent"
      ],
      "benefits": [
        "30% employee discount on books and merchandise",
        "First access to new releases and ARCs (Advanced Reader Copies)",
        "Flexible scheduling",
        "Friendly, book-loving team environment"
      ],
      "salary_min": 13.50,
      "salary_max": 15.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 12,
      "company_name": "Cyber Defense Solutions",
      "company_description": "Cyber Defense Solutions is a cybersecurity consulting firm providing penetration testing, security assessments, and incident response services to Fortune 500 companies and government agencies. We employ 300+ security professionals across North America.",
      "position_title": "Senior Penetration Tester",
      "job_type": "Full Time",
      "location": "Remote (US only, must be able to obtain security clearance)",
      "position_summary": "Cyber Defense Solutions is seeking an elite Senior Penetration Tester to conduct sophisticated security assessments for our enterprise and government clients. You'll identify vulnerabilities in complex environments, simulate real-world attacks, and provide actionable recommendations to strengthen our clients' security posture.",
      "primary_responsibilities": [
        "Conduct comprehensive penetration tests on web applications, networks, wireless systems, and cloud infrastructure",
        "Perform red team operations and adversary simulations",
        "Identify and exploit security vulnerabilities using manual and automated techniques",
        "Develop custom exploit code and scripts as needed",
        "Document findings and prepare detailed technical reports for clients",
        "Present assessment results to technical and executive audiences",
        "Stay current on emerging threats, vulnerabilities, and attack techniques",
        "Mentor junior penetration testers and conduct internal training",
        "Participate in tool development and security research initiatives",
        "Support incident response engagements as needed"
      ],
      "requirements": [
        "Bachelor's degree in Computer Science, Information Security, or related field (or equivalent experience)",
        "5+ years of hands-on penetration testing experience",
        "Expert knowledge of common vulnerabilities (OWASP Top 10, CVEs)",
        "Proficiency with testing tools (Burp Suite, Metasploit, Cobalt Strike, BloodHound, etc.)",
        "Strong scripting skills in Python, PowerShell, or Bash",
        "Deep understanding of networking protocols, operating systems, and security controls",
        "Experience with cloud platforms (AWS, Azure, GCP) security testing",
        "OSCP, OSCE, or GXPN certification required; additional certs (GPEN, GWAPT, CRTO) highly valued",
        "Ability to obtain DoD Secret clearance or higher",
        "Excellent written and verbal communication skills",
        "Self-motivated with strong time management abilities"
      ],
      "benefits": [
        "Competitive salary with annual performance bonuses",
        "100% remote work with flexible hours",
        "Comprehensive health, dental, vision, and life insurance",
        "401(k) with 6% match",
        "Generous PTO policy (4 weeks) plus paid holidays",
        "$5,000 annual training and certification budget",
        "Conference attendance opportunities (Black Hat, DEF CON, etc.)",
        "Latest security testing equipment and software",
        "Home office setup stipend ($2,000)",
        "Professional membership reimbursement"
      ],
      "salary_min": 130000,
      "salary_max": 170000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 13,
      "company_name": "Harvest Moon Farm",
      "company_description": "Harvest Moon Farm is a 40-acre certified organic farm growing vegetables, herbs, and flowers for local farmers' markets, restaurants, and our CSA program. We're committed to sustainable agriculture and community education.",
      "position_title": "Farm Hand",
      "job_type": "Seasonal Full Time",
      "location": "On-site in Ithaca, NY",
      "position_summary": "Harvest Moon Farm is hiring dedicated farm hands for the growing season (April-October). You'll work alongside our experienced farm team planting, cultivating, harvesting, and packing organic produce.",
      "primary_responsibilities": [
        "Plant, weed, and harvest vegetables according to seasonal schedules",
        "Prepare produce for market including washing, bunching, and packing",
        "Maintain garden beds through cultivation, mulching, and composting",
        "Operate and maintain farm equipment (tractors, tillers, irrigation systems)",
        "Assist with greenhouse management and seedling production",
        "Help with farm stand and farmers' market sales as needed",
        "Maintain clean and organized work areas and storage facilities",
        "Participate in farm work days and community events"
      ],
      "requirements": [
        "Previous farm or gardening experience helpful but not required",
        "Ability to work outdoors in various weather conditions",
        "Capacity to perform physical labor including bending, lifting (50 lbs), and standing for extended periods",
        "Willingness to learn organic farming practices",
        "Reliable transportation to farm location",
        "Availability to work some weekends during peak season",
        "Positive attitude and strong work ethic"
      ],
      "benefits": [
        "Weekly farm share of fresh organic produce",
        "Hands-on learning in organic agriculture",
        "Beautiful rural work environment",
        "Potential for housing on farm property (limited availability)"
      ],
      "salary_min": 15.00,
      "salary_max": 17.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 14,
      "company_name": "Metropolis Airlines",
      "company_description": "Metropolis Airlines is a major international carrier operating over 3,000 daily flights to 350 destinations worldwide. With a fleet of 800 aircraft and 85,000 employees, we're committed to connecting people and delivering exceptional travel experiences.",
      "position_title": "Captain - Boeing 787",
      "job_type": "Full Time",
      "location": "Based in Atlanta, GA (extensive travel required)",
      "position_summary": "Metropolis Airlines is seeking experienced Captains for our Boeing 787 Dreamliner fleet operating long-haul international routes. The ideal candidate will demonstrate superior airmanship, leadership, and commitment to safety while providing excellent service to our passengers.",
      "primary_responsibilities": [
        "Serve as Pilot-in-Command for Boeing 787 aircraft on international routes",
        "Ensure safe operation of aircraft in compliance with FAA regulations and company procedures",
        "Conduct thorough pre-flight planning including weather, fuel, routing, and NOTAMs",
        "Lead flight crew and coordinate with cabin crew to ensure smooth operations",
        "Make critical decisions regarding flight safety and aircraft operations",
        "Communicate effectively with ATC, dispatch, and maintenance personnel",
        "Mentor and evaluate First Officers and provide constructive feedback",
        "Maintain current knowledge of aircraft systems, procedures, and regulations",
        "Complete required training, proficiency checks, and recurrent certification",
        "Represent Metropolis Airlines professionally at all times"
      ],
      "requirements": [
        "FAA Airline Transport Pilot (ATP) certificate required",
        "Current First Class Medical Certificate",
        "Minimum 4,000 total flight hours",
        "Minimum 1,500 hours as Pilot-in-Command",
        "Minimum 1,000 hours multi-engine turbine time",
        "Boeing 787 type rating required or willingness to obtain in training",
        "International operations experience strongly preferred",
        "Bachelor's degree preferred but not required",
        "Excellent communication and crew resource management skills",
        "Ability to pass background check and security clearance",
        "Valid US passport with ability to travel internationally",
        "Must be able to relocate to Atlanta domicile"
      ],
      "benefits": [
        "Starting salary $250,000+ with annual increases per contract",
        "Comprehensive health, dental, and vision insurance for employee and family",
        "Defined benefit pension plan plus 401(k) with company match",
        "Trip pay, per diem, and international override pay",
        "Unlimited flight benefits for employee and immediate family",
        "Reduced rate flight benefits for extended family and friends",
        "Company-provided uniforms and luggage",
        "Union representation with strong contract protections",
        "Long-term disability and life insurance",
        "Hotel and transportation provided during layovers"
      ],
      "salary_min": 250000,
      "salary_max": 350000,
      "pay_period": "Annual",
      "relocation_required": "Must be based in Atlanta, GA"
    },
    {
      "id": 15,
      "company_name": "Bright Futures Childcare Center",
      "company_description": "Bright Futures is a licensed childcare center serving children ages 6 weeks to 5 years. Our play-based curriculum focuses on social-emotional development, early literacy, and STEM exploration in a nurturing environment.",
      "position_title": "Preschool Teacher",
      "job_type": "Full Time",
      "location": "On-site in Boise, ID",
      "position_summary": "Bright Futures is seeking a warm, creative Preschool Teacher to lead our 3-4 year old classroom. You'll plan and implement developmentally appropriate activities, build strong relationships with children and families, and create a joyful learning environment.",
      "primary_responsibilities": [
        "Develop and implement age-appropriate lesson plans and activities",
        "Create a safe, nurturing classroom environment that supports learning through play",
        "Observe and assess children's development and maintain portfolios",
        "Build positive relationships with children and guide social-emotional development",
        "Communicate regularly with families about their child's progress and daily activities",
        "Maintain organized classroom with engaging learning centers",
        "Supervise children during meals, naps, outdoor play, and transitions",
        "Collaborate with co-teachers and support staff",
        "Follow all licensing regulations and center policies",
        "Participate in staff meetings and professional development"
      ],
      "requirements": [
        "Associate's degree in Early Childhood Education or related field (Bachelor's preferred)",
        "State childcare credential or willingness to obtain",
        "2+ years of experience working with preschool-aged children",
        "Knowledge of child development and early childhood best practices",
        "CPR and First Aid certification (or willingness to obtain)",
        "Patience, creativity, and genuine love for working with young children",
        "Strong communication skills with children, families, and colleagues",
        "Ability to lift and carry children (up to 40 lbs)",
        "Clear background check and fingerprinting required",
        "TB test clearance"
      ],
      "benefits": [
        "Childcare discount (50% off for employee's children)",
        "Health and dental insurance",
        "Paid holidays and school closures",
        "2 weeks PTO",
        "Professional development opportunities",
        "Fun, supportive work environment"
      ],
      "salary_min": 32000,
      "salary_max": 38000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 16,
      "company_name": "Precision Manufacturing Corp",
      "company_description": "Precision Manufacturing Corp is an ISO 9001 certified manufacturer of custom machined components for aerospace, defense, and medical device industries. Our 120,000 sq ft facility houses state-of-the-art CNC equipment and employs 180 skilled machinists and engineers.",
      "position_title": "CNC Machinist",
      "job_type": "Full Time",
      "location": "On-site in Wichita, KS",
      "position_summary": "Precision Manufacturing is seeking skilled CNC Machinists to set up and operate multi-axis CNC mills and lathes producing complex, tight-tolerance components. You'll work with exotic materials and contribute to parts that go into critical aerospace and medical applications.",
      "primary_responsibilities": [
        "Set up and operate CNC mills and lathes (3-axis and 5-axis equipment)",
        "Read and interpret blueprints, technical drawings, and GD&T specifications",
        "Select appropriate cutting tools, fixtures, and measuring instruments",
        "Edit CNC programs to optimize cycle times and tool life",
        "Perform first article inspections using precision measuring equipment (CMM, micrometers, calipers, etc.)",
        "Monitor machine operations and make necessary adjustments to maintain quality",
        "Maintain accurate production documentation and quality records",
        "Perform routine machine maintenance and report issues to maintenance team",
        "Follow all safety protocols and wear required PPE",
        "Participate in continuous improvement initiatives"
      ],
      "requirements": [
        "High school diploma or equivalent; technical school certificate preferred",
        "3-5 years of CNC machining experience required",
        "Proficiency in reading blueprints and GD&T tolerancing",
        "Experience with Fanuc, Haas, or Mazak controls",
        "Knowledge of machining exotic materials (titanium, Inconel, stainless steel)",
        "Ability to use precision measuring instruments accurately",
        "Basic G-code programming and editing skills",
        "Strong mathematical and problem-solving abilities",
        "Attention to detail and quality-focused mindset",
        "Ability to lift 50 lbs and stand for extended periods",
        "Willingness to work overtime as needed"
      ],
      "benefits": [
        "Competitive hourly wage based on experience",
        "Shift differential for 2nd and 3rd shifts",
        "Overtime opportunities (typically 5-10 hours per week)",
        "Health, dental, and vision insurance",
        "401(k) with 4% company match",
        "Paid holidays and vacation",
        "Annual tool allowance",
        "Tuition reimbursement for skills training",
        "Clean, climate-controlled shop environment",
        "Safety incentive programs"
      ],
      "salary_min": 24.00,
      "salary_max": 32.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 17,
      "company_name": "Coastal Property Management",
      "company_description": "Coastal Property Management oversees 450+ rental properties ranging from single-family homes to multi-unit apartment complexes throughout the Tampa Bay area. We provide full-service property management for real estate investors.",
      "position_title": "Maintenance Technician",
      "job_type": "Full Time",
      "location": "On-site in Tampa, FL",
      "position_summary": "Coastal Property Management is hiring a Maintenance Technician to perform repairs and maintenance across our portfolio of rental properties. You'll respond to tenant work orders, perform preventative maintenance, and help maintain property values for our owners.",
      "primary_responsibilities": [
        "Respond to and complete maintenance work orders in a timely manner",
        "Perform general repairs including plumbing, electrical, HVAC, drywall, and painting",
        "Conduct property inspections and identify maintenance needs",
        "Perform unit turns between tenants (cleaning, painting, repairs)",
        "Complete preventative maintenance tasks (HVAC filter changes, smoke detector checks, etc.)",
        "Coordinate with vendors and contractors for specialized repairs",
        "Maintain accurate records of work completed and materials used",
        "Ensure properties are secure and report safety hazards",
        "Provide excellent customer service to tenants and property owners",
        "Be on-call for emergency maintenance issues on rotation"
      ],
      "requirements": [
        "2+ years of maintenance experience in residential properties",
        "General knowledge of plumbing, electrical, HVAC, and carpentry",
        "Valid driver's license with clean driving record",
        "Ability to use hand and power tools safely",
        "Basic computer skills for work order system",
        "Ability to lift 75 lbs and work on ladders",
        "Strong problem-solving and troubleshooting skills",
        "Professional appearance and customer service orientation",
        "HVAC certification or electrical license a plus",
        "Flexible schedule including occasional evenings and weekends"
      ],
      "benefits": [
        "Company vehicle or vehicle allowance",
        "Company cell phone",
        "Tools and equipment provided",
        "Health insurance",
        "Paid time off",
        "Overtime pay for after-hours emergency calls",
        "Ongoing training opportunities"
      ],
      "salary_min": 19.00,
      "salary_max": 24.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 18,
      "company_name": "DataViz Analytics",
      "company_description": "DataViz Analytics is a boutique data science consultancy helping organizations turn data into actionable insights. Our team of 25 data scientists and analysts work with clients across healthcare, finance, and retail sectors.",
      "position_title": "Data Scientist",
      "job_type": "Full Time",
      "location": "Hybrid in Boston, MA (2 days in office)",
      "position_summary": "DataViz Analytics is seeking a talented Data Scientist to work on diverse client projects involving predictive modeling, machine learning, and data visualization. You'll collaborate with clients to understand their business challenges and develop data-driven solutions.",
      "primary_responsibilities": [
        "Design and implement machine learning models for classification, regression, and clustering problems",
        "Perform exploratory data analysis and feature engineering on complex datasets",
        "Develop predictive models using Python, R, and relevant ML libraries",
        "Create compelling data visualizations and dashboards using Tableau, Power BI, or similar tools",
        "Communicate findings and recommendations to technical and non-technical stakeholders",
        "Collaborate with clients to define project requirements and success metrics",
        "Conduct A/B testing and statistical analysis to validate model performance",
        "Document methodology, code, and results thoroughly",
        "Stay current on latest data science techniques and tools",
        "Mentor junior analysts and contribute to knowledge sharing"
      ],
      "requirements": [
        "Master's degree or PhD in Data Science, Statistics, Computer Science, or quantitative field",
        "3+ years of experience in data science or analytics role",
        "Strong programming skills in Python (pandas, scikit-learn, TensorFlow/PyTorch)",
        "Proficiency with SQL and experience working with large datasets",
        "Experience with data visualization tools (Tableau, Power BI, or matplotlib/seaborn)",
        "Solid understanding of statistical methods and machine learning algorithms",
        "Experience with cloud platforms (AWS, Azure, or GCP)",
        "Excellent communication and presentation skills",
        "Ability to translate business problems into analytical solutions",
        "Consulting or client-facing experience preferred"
      ],
      "benefits": [
        "Competitive salary with annual performance bonuses",
        "Hybrid work arrangement with flexible scheduling",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with 5% match",
        "Generous PTO policy (4 weeks)",
        "Professional development budget ($3,000 annually)",
        "Conference attendance opportunities",
        "Latest technology and software tools",
        "Collaborative, intellectually stimulating environment"
      ],
      "salary_min": 105000,
      "salary_max": 135000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 19,
      "company_name": "Metro City Hospital",
      "company_description": "Metro City Hospital is a 450-bed Level I Trauma Center and teaching hospital serving a diverse urban population. We're a nationally recognized healthcare system known for clinical excellence, research innovation, and commitment to health equity.",
      "position_title": "Registered Nurse - Emergency Department",
      "job_type": "Full Time",
      "location": "On-site in Detroit, MI",
      "position_summary": "Metro City Hospital is seeking experienced Registered Nurses for our fast-paced Emergency Department. You'll provide high-quality care to patients with diverse, acute medical conditions ranging from minor injuries to life-threatening emergencies.",
      "primary_responsibilities": [
        "Perform rapid patient assessment and triage using ESI protocols",
        "Initiate and manage emergency treatments including IV therapy, medications, and procedures",
        "Monitor patient conditions and respond quickly to changes in status",
        "Collaborate with physicians, specialists, and multidisciplinary team members",
        "Operate medical equipment including cardiac monitors, defibrillators, and ventilators",
        "Document patient care accurately in electronic health record system",
        "Educate patients and families about treatments, medications, and discharge instructions",
        "Maintain a safe, clean environment following infection control protocols",
        "Respond to trauma activations and participate in resuscitation efforts",
        "Mentor new nurses and nursing students",
        "Participate in quality improvement and safety initiatives"
      ],
      "requirements": [
        "Bachelor of Science in Nursing (BSN) required",
        "Current Michigan RN license in good standing",
        "BLS, ACLS, and PALS certification required",
        "TNCC or ENPC certification preferred",
        "Minimum 2 years of ED nursing experience required",
        "Strong critical thinking and clinical assessment skills",
        "Ability to remain calm under pressure and manage multiple priorities",
        "Excellent communication and interpersonal skills",
        "Physical ability to stand for 12-hour shifts and assist with patient transfers",
        "Flexibility to work rotating shifts including nights, weekends, and holidays"
      ],
      "benefits": [
        "Sign-on bonus ($10,000 for experienced ED RNs)",
        "Competitive hourly rate with shift differentials (night, weekend, charge nurse)",
        "Comprehensive benefits package (health, dental, vision, life insurance)",
        "Retirement plan with employer contributions",
        "Generous PTO accrual and paid holidays",
        "Tuition reimbursement and loan forgiveness programs",
        "Free parking and subsidized cafeteria meals",
        "Professional development and specialty certification support",
        "Clinical ladder advancement opportunities",
        "Employee wellness programs and fitness center access"
      ],
      "salary_min": 35.00,
      "salary_max": 48.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 20,
      "company_name": "Summit Legal Group",
      "company_description": "Summit Legal Group is a mid-sized law firm with 85 attorneys specializing in corporate law, litigation, intellectual property, and employment law. We serve Fortune 500 clients and emerging companies across the Pacific Northwest.",
      "position_title": "Paralegal - Corporate Transactions",
      "job_type": "Full Time",
      "location": "Hybrid in Seattle, WA (3 days in office)",
      "position_summary": "Summit Legal Group is seeking an experienced Corporate Paralegal to support our transactional practice. You'll work closely with attorneys on mergers and acquisitions, securities offerings, commercial contracts, and corporate governance matters.",
      "primary_responsibilities": [
        "Assist with due diligence for M&A transactions including document review and organization",
        "Prepare and file corporate formation documents, amendments, and annual reports",
        "Maintain corporate minute books and governance records",
        "Draft board resolutions, bylaws, and organizational documents",
        "Coordinate closings including preparation of closing checklists and binders",
        "Conduct UCC, lien, and corporate entity searches",
        "Review and summarize commercial contracts and agreements",
        "Manage document databases and virtual data rooms",
        "Communicate with clients, opposing counsel, and government agencies",
        "Assist with securities filings and regulatory compliance matters",
        "Track and manage deadlines using matter management systems"
      ],
      "requirements": [
        "Bachelor's degree required; Paralegal certificate from ABA-approved program preferred",
        "4+ years of corporate paralegal experience at a law firm",
        "Strong knowledge of corporate law, M&A process, and commercial transactions",
        "Experience with entity formation and corporate governance",
        "Proficiency with contract management and due diligence platforms",
        "Excellent organizational skills and meticulous attention to detail",
        "Ability to manage multiple matters simultaneously and meet tight deadlines",
        "Strong written and verbal communication skills",
        "Proficiency with Microsoft Office Suite and document management systems",
        "Notary Public commission preferred"
      ],
      "benefits": [
        "Competitive salary commensurate with experience",
        "Annual discretionary bonus",
        "Comprehensive health, dental, and vision insurance (employer-paid)",
        "401(k) plan with generous employer match",
        "3 weeks PTO plus firm holidays and winter break closure",
        "Hybrid work schedule with flexibility",
        "Professional development and CLE opportunities",
        "Subsidized parking or transit pass",
        "Business casual dress code",
        "Collaborative, collegial work environment"
      ],
      "salary_min": 75000,
      "salary_max": 95000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 21,
      "company_name": "Wildwood Adventure Camp",
      "company_description": "Wildwood Adventure Camp is a residential summer camp in the Adirondacks offering traditional camp activities, outdoor education, and leadership development for youth ages 8-16. Each summer we serve 400+ campers over eight weeks.",
      "position_title": "Summer Camp Counselor",
      "job_type": "Seasonal Full Time",
      "location": "On-site in Lake Placid, NY (residential position)",
      "position_summary": "Wildwood is hiring enthusiastic Camp Counselors for summer 2025 (June-August). You'll live on-site, supervise a cabin group of 8-10 campers, lead activities, and help create magical summer memories while ensuring camper safety and well-being.",
      "primary_responsibilities": [
        "Supervise and ensure safety of assigned cabin group 24/7",
        "Lead and assist with camp activities (swimming, archery, arts & crafts, hiking, etc.)",
        "Build positive relationships with campers and foster inclusive community",
        "Assist with meals, cabin clean-up, and daily routines",
        "Participate in evening programs, campfires, and special events",
        "Communicate camper progress and concerns to Camp Director",
        "Enforce camp rules and policies consistently and fairly",
        "Respond appropriately to homesickness, conflicts, and behavioral issues",
        "Model positive behavior, enthusiasm, and respect",
        "Attend all staff meetings and training sessions"
      ],
      "requirements": [
        "Must be at least 18 years old",
        "Experience working with children or adolescents (camp, teaching, coaching, etc.)",
        "Enthusiasm, patience, and genuine enjoyment of working with youth",
        "Ability to live in rustic conditions and adapt to outdoor living",
        "Physical ability to participate in active camp programming",
        "Strong communication and problem-solving skills",
        "Current CPR and First Aid certification (or complete before arrival)",
        "Completion of background check",
        "Availability for entire 8-10 week summer season",
        "Skills in specific activity areas (waterfront, ropes course, etc.) a plus"
      ],
      "benefits": [
        "Room and board provided",
        "All meals included",
        "Laundry service",
        "Training in youth development and outdoor education",
        "Beautiful Adirondack location",
        "Time off during camper session breaks",
        "Lifelong friendships and meaningful work experience"
      ],
      "salary_min": 2800,
      "salary_max": 3500,
      "pay_period": "Seasonal stipend for 8-10 weeks",
      "relocation_required": null
    },
    {
      "id": 22,
      "company_name": "Quantum Robotics Inc.",
      "company_description": "Quantum Robotics is a venture-backed startup developing autonomous mobile robots for warehouse and fulfillment center operations. Our AI-powered robots improve efficiency and safety in logistics environments. We've raised $45M in Series B funding.",
      "position_title": "Robotics Software Engineer",
      "job_type": "Full Time",
      "location": "On-site in Pittsburgh, PA",
      "position_summary": "Quantum Robotics is seeking a talented Robotics Software Engineer to develop perception, navigation, and manipulation algorithms for our autonomous mobile robots. You'll work at the intersection of robotics, computer vision, and machine learning in a dynamic startup environment.",
      "primary_responsibilities": [
        "Design and implement algorithms for robot localization, mapping, and navigation (SLAM)",
        "Develop computer vision systems for object detection, recognition, and tracking",
        "Implement motion planning and control algorithms for autonomous navigation",
        "Integrate sensor data from LiDAR, cameras, IMU, and other sensors",
        "Optimize algorithm performance for real-time operation on embedded systems",
        "Conduct testing and validation in simulation and physical environments",
        "Debug and troubleshoot software issues in robotic systems",
        "Collaborate with mechanical, electrical, and systems engineers",
        "Document code, algorithms, and technical specifications",
        "Participate in code reviews and contribute to software architecture decisions"
      ],
      "requirements": [
        "Master's degree or PhD in Robotics, Computer Science, or related field",
        "3+ years of experience in robotics software development",
        "Strong programming skills in C++ and Python",
        "Experience with ROS (Robot Operating System)",
        "Knowledge of SLAM algorithms, path planning, and control theory",
        "Familiarity with computer vision libraries (OpenCV, PCL) and deep learning frameworks",
        "Understanding of sensor integration and calibration",
        "Experience with Linux development environments",
        "Strong mathematical foundation in linear algebra, probability, and optimization",
        "Excellent problem-solving and debugging skills",
        "Passion for robotics and autonomous systems"
      ],
      "benefits": [
        "Competitive salary with significant equity package (0.25% - 1.0%)",
        "Health, dental, and vision insurance (90% employer-paid)",
        "401(k) plan",
        "Unlimited PTO policy",
        "Relocation assistance available",
        "Professional development budget",
        "Cutting-edge robotics lab and equipment",
        "Collaborative startup culture",
        "Free snacks, drinks, and catered lunches",
        "Regular team outings and events"
      ],
      "salary_min": 120000,
      "salary_max": 160000,
      "pay_period": "Annual",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 23,
      "company_name": "Green Valley Community College",
      "company_description": "Green Valley Community College is a public two-year institution serving 12,000 students with transfer programs, career technical education, and workforce development. We're committed to affordable, accessible education and student success.",
      "position_title": "Adjunct Instructor - English Composition",
      "job_type": "Part Time",
      "location": "Hybrid in Henderson, NV",
      "position_summary": "Green Valley Community College seeks qualified Adjunct Instructors to teach English Composition courses. You'll help students develop critical thinking, reading, and writing skills essential for academic and professional success.",
      "primary_responsibilities": [
        "Teach 1-2 sections of English Composition (ENG 101 or ENG 102)",
        "Develop and deliver engaging lessons on writing process, rhetoric, and critical analysis",
        "Assign and evaluate student essays and writing assignments",
        "Provide constructive feedback to help students improve writing skills",
        "Hold office hours (virtual or in-person) for student support",
        "Maintain accurate grade records and submit grades by deadline",
        "Create inclusive, supportive classroom environment",
        "Utilize learning management system (Canvas) for course materials",
        "Participate in department meetings as requested",
        "Follow college policies and maintain professional standards"
      ],
      "requirements": [
        "Master's degree in English, Composition/Rhetoric, or related field required",
        "18 graduate credit hours in English required",
        "College-level teaching experience preferred",
        "Strong knowledge of composition pedagogy and writing instruction",
        "Commitment to student-centered teaching and diverse learners",
        "Proficiency with learning management systems",
        "Excellent communication and organizational skills",
        "Availability for day, evening, or online course sections",
        "Completion of background check"
      ],
      "benefits": [
        "Competitive per-credit compensation",
        "Flexible schedule",
        "Professional development opportunities",
        "Access to college facilities and resources",
        "Opportunity to make a difference in students' lives"
      ],
      "salary_min": 850,
      "salary_max": 1100,
      "pay_period": "Per 3-credit course",
      "relocation_required": null
    },
    {
      "id": 24,
      "company_name": "Artisan Bread Company",
      "company_description": "Artisan Bread Company is a wholesale bakery producing handcrafted sourdough breads, pastries, and specialty baked goods for restaurants, cafes, and grocery stores throughout the San Francisco Bay Area.",
      "position_title": "Baker - Night Shift",
      "job_type": "Full Time",
      "location": "On-site in Oakland, CA",
      "position_summary": "Artisan Bread Company is seeking experienced Bakers for our night shift production team (10pm-6am). You'll mix, shape, and bake high-quality artisan breads using traditional techniques and natural leavening.",
      "primary_responsibilities": [
        "Mix dough batches following recipes and baker's percentages",
        "Shape breads by hand including baguettes, boules, and specialty loaves",
        "Monitor sourdough starter cultures and maintain proper fermentation",
        "Load and operate deck ovens, ensuring proper temperature and steam",
        "Score breads and achieve desired crust appearance",
        "Monitor bake times and temperatures for consistent quality",
        "Package finished products according to customer specifications",
        "Maintain clean and organized work area following food safety standards",
        "Track production quantities and communicate with production manager",
        "Perform opening or closing duties as assigned"
      ],
      "requirements": [
        "2+ years of professional baking experience required",
        "Experience with artisan bread and sourdough strongly preferred",
        "Knowledge of bread baking techniques, fermentation, and oven operation",
        "Ability to lift 50 lbs (flour bags) repeatedly",
        "Comfortable working with heat and standing for entire shift",
        "Attention to detail and consistency",
        "Ability to work independently and as part of a team",
        "Reliable attendance and punctuality essential",
        "Food Handler's Card (or willingness to obtain)",
        "Flexibility to work weekends and holidays as needed"
      ],
      "benefits": [
        "Night shift differential ($3/hour additional)",
        "Health insurance after 90 days",
        "Paid time off",
        "Free bread and employee discount on products",
        "Opportunity to work with high-quality ingredients and traditional methods",
        "Supportive, skilled team environment"
      ],
      "salary_min": 22.00,
      "salary_max": 28.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 25,
      "company_name": "Sterling & Associates CPAs",
      "company_description": "Sterling & Associates is a regional accounting firm providing audit, tax, and advisory services to businesses and individuals. With 45 CPAs and offices in three states, we're known for technical expertise and personalized client service.",
      "position_title": "Senior Tax Accountant",
      "job_type": "Full Time",
      "location": "Hybrid in Des Moines, IA (3 days in office during non-busy season)",
      "position_summary": "Sterling & Associates seeks a Senior Tax Accountant to manage tax compliance and planning for our diverse client base including partnerships, S-corporations, and high-net-worth individuals. You'll prepare complex returns, research tax issues, and mentor staff accountants.",
      "primary_responsibilities": [
        "Prepare and review complex federal and state income tax returns (1040, 1120-S, 1065, 1041)",
        "Conduct tax research and provide technical guidance on complex tax issues",
        "Develop tax planning strategies to minimize client tax liabilities",
        "Review work prepared by staff and senior accountants for accuracy",
        "Manage client relationships and communicate tax positions clearly",
        "Supervise and mentor staff accountants and interns",
        "Assist with IRS and state tax audits and correspondence",
        "Stay current on tax law changes and attend continuing education",
        "Identify opportunities for additional services and business development",
        "Utilize tax software (CCH ProSystem fx, Thomson Reuters) efficiently"
      ],
      "requirements": [
        "Bachelor's degree in Accounting required; Master's in Taxation preferred",
        "CPA license required",
        "5-7 years of public accounting tax experience",
        "Strong technical knowledge of federal and multi-state taxation",
        "Experience with partnership and S-corporation taxation",
        "Proficiency with tax research tools (RIA, CCH, BNA)",
        "Excellent analytical and problem-solving skills",
        "Strong communication skills with clients and team members",
        "Ability to manage multiple engagements and meet deadlines",
        "Willingness to work extended hours during tax season (Jan-April)"
      ],
      "benefits": [
        "Competitive salary with annual increases",
        "Performance bonuses",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with profit sharing",
        "3 weeks PTO (4 weeks after 5 years)",
        "Flexible hybrid schedule outside of busy season",
        "CPA exam review course reimbursement",
        "Annual CPE and professional dues paid",
        "Casual dress during summer months",
        "Strong work-life balance focus"
      ],
      "salary_min": 75000,
      "salary_max": 95000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 26,
      "company_name": "TechForward Solutions",
      "company_description": "TechForward Solutions is a managed IT services provider supporting small and medium-sized businesses across the Southeast. We offer 24/7 network monitoring, cybersecurity, cloud services, and helpdesk support to 200+ clients.",
      "position_title": "IT Support Specialist",
      "job_type": "Full Time",
      "location": "On-site in Raleigh, NC",
      "position_summary": "TechForward is seeking an IT Support Specialist to provide technical support to our clients via phone, email, and remote sessions. You'll troubleshoot hardware and software issues, assist with user account management, and help maintain client systems.",
      "primary_responsibilities": [
        "Respond to helpdesk tickets and provide timely technical support",
        "Troubleshoot Windows and Mac OS issues, Office 365, and common business applications",
        "Assist with user account creation, password resets, and permissions management",
        "Provide remote support using tools like TeamViewer and ConnectWise",
        "Document all support interactions in ticketing system",
        "Escalate complex issues to senior technicians or engineers",
        "Assist with onboarding new client users and equipment setup",
        "Perform basic network troubleshooting",
        "Maintain professional, friendly communication with clients",
        "Participate in on-call rotation for after-hours support (1 week per month)"
      ],
      "requirements": [
        "Associate's degree in Information Technology or related field, or equivalent experience",
        "1-3 years of IT support or helpdesk experience",
        "Strong knowledge of Windows 10/11 and Microsoft Office 365",
        "Understanding of basic networking concepts (TCP/IP, DNS, DHCP)",
        "Experience with Active Directory and Azure AD",
        "Excellent customer service and communication skills",
        "Strong problem-solving abilities and patience",
        "Ability to explain technical concepts to non-technical users",
        "CompTIA A+ or Network+ certification preferred",
        "Valid driver's license for occasional on-site client visits"
      ],
      "benefits": [
        "Health and dental insurance",
        "401(k) with company match",
        "2 weeks PTO plus paid holidays",
        "Certification training and exam reimbursement",
        "Company-provided laptop and phone",
        "Casual work environment",
        "Growth opportunities within the company"
      ],
      "salary_min": 45000,
      "salary_max": 55000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 27,
      "company_name": "Urban Eats Restaurant Group",
      "company_description": "Urban Eats operates five upscale casual dining restaurants in downtown Chicago, known for seasonal menus, craft cocktails, and exceptional hospitality. Our restaurants have won multiple awards and consistently receive top reviews.",
      "position_title": "Executive Chef",
      "job_type": "Full Time",
      "location": "On-site in Chicago, IL",
      "position_summary": "Urban Eats is seeking a creative and experienced Executive Chef for our flagship location. You'll oversee all culinary operations, develop innovative seasonal menus, manage kitchen staff, and maintain our reputation for culinary excellence.",
      "primary_responsibilities": [
        "Lead all kitchen operations and maintain high standards of food quality and presentation",
        "Create seasonal menus featuring locally-sourced ingredients and modern techniques",
        "Manage food cost, labor cost, and kitchen budget to meet financial targets",
        "Hire, train, and develop culinary team including sous chefs, line cooks, and prep staff",
        "Ensure compliance with health department regulations and food safety standards",
        "Manage inventory, ordering, and vendor relationships",
        "Collaborate with General Manager and ownership on restaurant strategy",
        "Maintain consistency across all menu items and stations",
        "Handle special dietary requests and create custom tasting menus",
        "Foster positive kitchen culture and lead by example",
        "Participate in local food events and represent the restaurant in the community"
      ],
      "requirements": [
        "Culinary degree from accredited institution or equivalent experience",
        "8+ years of progressive culinary experience with 3+ years as Executive Chef or CDC",
        "Fine dining or upscale casual experience required",
        "Proven ability to create innovative, seasonally-driven menus",
        "Strong leadership and team management skills",
        "Excellent understanding of food costing, inventory management, and P&L",
        "Knowledge of current culinary trends and techniques",
        "Ability to work efficiently under pressure in fast-paced environment",
        "ServSafe Manager certification required",
        "Strong communication and interpersonal skills",
        "Flexibility to work nights, weekends, and holidays"
      ],
      "benefits": [
        "Competitive salary commensurate with experience",
        "Performance-based quarterly bonuses",
        "Health insurance",
        "Paid vacation",
        "Dining discounts at all restaurant group locations",
        "Professional development opportunities and industry event attendance",
        "Creative freedom and support for culinary vision",
        "Opportunity to build and lead talented team"
      ],
      "salary_min": 75000,
      "salary_max": 95000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 28,
      "company_name": "SafeGuard Insurance Company",
      "company_description": "SafeGuard is a regional insurance carrier providing property and casualty insurance to individuals and businesses. Founded in 1955, we maintain an A- rating from A.M. Best and serve policyholders across 12 states.",
      "position_title": "Claims Adjuster - Property",
      "job_type": "Full Time",
      "location": "Hybrid in Indianapolis, IN (2 days in office)",
      "position_summary": "SafeGuard is seeking a Property Claims Adjuster to investigate, evaluate, and settle property damage claims. You'll work with policyholders, contractors, and vendors to provide fair and timely claim resolutions while ensuring compliance with policy terms and regulations.",
      "primary_responsibilities": [
        "Investigate property damage claims including residential and commercial losses",
        "Conduct site inspections to assess damage and determine coverage",
        "Review policy coverage, exclusions, and endorsements",
        "Estimate repair costs using Xactimate software",
        "Negotiate settlements with policyholders and public adjusters",
        "Coordinate with contractors, engineers, and other experts as needed",
        "Document claims activities and maintain detailed claim files",
        "Communicate claim status and decisions to policyholders clearly",
        "Identify and investigate potential fraud indicators",
        "Manage caseload of 80-100 claims efficiently",
        "Ensure compliance with state regulations and company guidelines",
        "Provide excellent customer service throughout claims process"
      ],
      "requirements": [
        "Bachelor's degree preferred or equivalent experience",
        "2-4 years of property claims adjusting experience",
        "Active adjuster license in Indiana (or ability to obtain)",
        "Proficiency with Xactimate estimating software",
        "Knowledge of construction, building materials, and repair processes",
        "Strong analytical and investigative skills",
        "Excellent negotiation and conflict resolution abilities",
        "Outstanding communication skills, both written and verbal",
        "Ability to work independently and manage time effectively",
        "Valid driver's license and reliable transportation",
        "Willingness to respond to catastrophic events (travel may be required)",
        "Professional designations (AIC, SCLA) preferred"
      ],
      "benefits": [
        "Comprehensive health, dental, vision, and life insurance",
        "401(k) with generous company match",
        "Pension plan",
        "Company vehicle or car allowance",
        "Cell phone and laptop provided",
        "3 weeks PTO plus paid holidays",
        "Professional development and designation support",
        "Annual performance bonuses",
        "Tuition reimbursement",
        "Hybrid work flexibility"
      ],
      "salary_min": 58000,
      "salary_max": 72000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 29,
      "company_name": "BrightPath Therapy Center",
      "company_description": "BrightPath is a pediatric therapy clinic providing speech, occupational, and physical therapy services to children from birth to age 18. Our multidisciplinary team serves families with compassion and evidence-based interventions.",
      "position_title": "Speech-Language Pathologist",
      "job_type": "Full Time",
      "location": "On-site in Portland, OR",
      "position_summary": "BrightPath seeks a dedicated Speech-Language Pathologist to provide evaluation and treatment services to children with communication and feeding/swallowing disorders. You'll work with a collaborative team in a supportive, family-centered environment.",
      "primary_responsibilities": [
        "Conduct comprehensive speech and language evaluations",
        "Develop and implement individualized treatment plans",
        "Provide therapy for articulation, language, fluency, voice, and feeding disorders",
        "Collaborate with occupational therapists, physical therapists, and families",
        "Document session notes, progress reports, and evaluation reports",
        "Communicate regularly with parents regarding child's progress and home strategies",
        "Participate in IEP meetings and coordinate with schools as needed",
        "Maintain caseload of approximately 35-40 clients per week",
        "Stay current on best practices through continuing education",
        "Mentor graduate students and clinical fellows as appropriate"
      ],
      "requirements": [
        "Master's degree in Speech-Language Pathology from ASHA-accredited program",
        "Certificate of Clinical Competence (CCC-SLP) from ASHA",
        "Oregon state licensure as Speech-Language Pathologist",
        "Experience with pediatric populations preferred",
        "Knowledge of developmental disorders including autism, apraxia, and language delays",
        "Strong interpersonal and family collaboration skills",
        "Excellent written and verbal communication abilities",
        "Compassionate, patient approach with children and families",
        "Ability to work as part of multidisciplinary team",
        "CPR certification"
      ],
      "benefits": [
        "Competitive salary based on experience",
        "Health, dental, and vision insurance",
        "401(k) retirement plan",
        "Generous PTO and paid holidays",
        "Continuing education allowance ($1,200 annually)",
        "ASHA membership and licensure fees paid",
        "Mentorship and professional development opportunities",
        "Supportive, collaborative work environment",
        "Flexible scheduling options available"
      ],
      "salary_min": 72000,
      "salary_max": 88000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 30,
      "company_name": "Velocity Logistics",
      "company_description": "Velocity Logistics is a third-party logistics provider specializing in warehousing, distribution, and freight brokerage. We operate 15 distribution centers nationwide and coordinate over 10,000 shipments daily for e-commerce and retail clients.",
      "position_title": "Warehouse Operations Manager",
      "job_type": "Full Time",
      "location": "On-site in Memphis, TN",
      "position_summary": "Velocity Logistics is seeking an experienced Warehouse Operations Manager to oversee our 300,000 sq ft distribution center. You'll manage daily operations, lead a team of 60+ warehouse associates, and ensure efficient, accurate order fulfillment.",
      "primary_responsibilities": [
        "Oversee all warehouse operations including receiving, storage, picking, packing, and shipping",
        "Manage and develop team of supervisors, leads, and warehouse associates",
        "Monitor KPIs including productivity, accuracy, safety, and on-time shipments",
        "Implement process improvements to increase efficiency and reduce costs",
        "Ensure compliance with safety regulations and company policies",
        "Manage labor planning and scheduling to meet volume demands",
        "Coordinate with transportation team on inbound and outbound shipments",
        "Oversee inventory accuracy and cycle counting programs",
        "Maintain warehouse management system (WMS) and troubleshoot issues",
        "Manage equipment maintenance and facility needs",
        "Conduct performance reviews and address employee relations issues",
        "Prepare operational reports for senior management"
      ],
      "requirements": [
        "Bachelor's degree in Supply Chain, Business, or related field preferred",
        "5-7 years of warehouse management experience in high-volume environment",
        "Experience managing teams of 50+ employees",
        "Strong knowledge of warehouse operations, logistics, and distribution",
        "Proficiency with warehouse management systems (Manhattan, SAP, or similar)",
        "Proven track record of process improvement and cost reduction",
        "Excellent leadership and people management skills",
        "Strong analytical and problem-solving abilities",
        "Outstanding communication and organizational skills",
        "Forklift certification and OSHA training preferred",
        "Lean Six Sigma certification a plus",
        "Ability to work flexible hours including occasional weekends"
      ],
      "benefits": [
        "Competitive salary with annual performance bonuses",
        "Comprehensive health benefits",
        "401(k) with company match",
        "3 weeks PTO plus paid holidays",
        "Company vehicle or car allowance",
        "Professional development opportunities",
        "Tuition reimbursement",
        "Advancement opportunities within growing company",
        "Safety incentive programs"
      ],
      "salary_min": 75000,
      "salary_max": 95000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 31,
      "company_name": "Pinnacle Financial Advisors",
      "company_description": "Pinnacle Financial Advisors is an independent wealth management firm serving high-net-worth individuals, families, and businesses. Our team of 12 advisors manages over $400M in client assets with a comprehensive approach to financial planning.",
      "position_title": "Financial Advisor",
      "job_type": "Full Time",
      "location": "Hybrid in Denver, CO (3 days in office)",
      "position_summary": "Pinnacle is seeking a motivated Financial Advisor to build and manage client relationships while providing comprehensive financial planning services. This role combines business development with technical financial planning expertise.",
      "primary_responsibilities": [
        "Develop new client relationships through networking, referrals, and business development",
        "Conduct comprehensive financial planning including retirement, tax, estate, and investment planning",
        "Manage client portfolios and make investment recommendations",
        "Monitor client accounts and rebalance as needed",
        "Communicate regularly with clients regarding financial markets and planning strategies",
        "Prepare financial plans and investment proposals",
        "Collaborate with CPAs, attorneys, and other professional advisors",
        "Ensure compliance with SEC regulations and firm policies",
        "Maintain detailed client records in CRM system",
        "Stay current on financial products, markets, and planning strategies",
        "Participate in client appreciation events and educational seminars"
      ],
      "requirements": [
        "Bachelor's degree in Finance, Business, or related field required",
        "CFP certification required or in progress (must complete within 2 years)",
        "Series 65 or Series 66 license required (or ability to obtain)",
        "3-5 years of financial planning or advisory experience",
        "Strong knowledge of investment products, financial planning, and tax strategies",
        "Proven ability to develop client relationships and generate new business",
        "Excellent communication and presentation skills",
        "High ethical standards and fiduciary mindset",
        "Proficiency with financial planning software (eMoney, MoneyGuidePro, etc.)",
        "Self-motivated with entrepreneurial spirit",
        "Experience with high-net-worth clients preferred"
      ],
      "benefits": [
        "Base salary plus performance-based compensation",
        "Revenue sharing on assets under management",
        "Comprehensive benefits package",
        "401(k) with profit sharing",
        "Professional development and CFP exam support",
        "Marketing support and administrative assistance",
        "Modern technology platform and tools",
        "Collaborative team environment",
        "Clear path to partnership for top performers"
      ],
      "salary_min": 70000,
      "salary_max": 90000,
      "pay_period": "Annual (base salary, additional compensation based on production)",
      "relocation_required": null
    },
    {
      "id": 32,
      "company_name": "Mountain Ridge Ski Resort",
      "company_description": "Mountain Ridge is a premier ski destination in Colorado featuring 3,000+ acres of terrain, 25 lifts, and world-class amenities. We welcome over 500,000 visitors annually and employ 1,200+ seasonal staff.",
      "position_title": "Ski Instructor",
      "job_type": "Seasonal Full Time",
      "location": "On-site in Vail, CO",
      "position_summary": "Mountain Ridge is hiring Ski Instructors for the 2025-26 winter season. You'll teach group and private lessons to guests of all ages and abilities, sharing your passion for skiing while ensuring safe, enjoyable learning experiences.",
      "primary_responsibilities": [
        "Teach ski lessons to individuals and groups following resort curriculum",
        "Assess students' skill levels and adapt instruction appropriately",
        "Demonstrate proper skiing techniques and safety procedures",
        "Create positive, encouraging learning environment for all ability levels",
        "Ensure student safety and follow mountain safety protocols",
        "Provide excellent customer service and represent resort professionally",
        "Maintain current knowledge of mountain conditions and terrain",
        "Attend staff meetings and training sessions",
        "Assist with children's ski school programs as needed",
        "Communicate effectively with guests and parents"
      ],
      "requirements": [
        "Advanced or expert skiing ability required",
        "PSIA (Professional Ski Instructors of America) certification Level 1 preferred, or willingness to obtain",
        "Previous teaching or coaching experience helpful but not required",
        "Availability for entire season (mid-November through early April)",
        "Ability to work weekends and holidays (peak season)",
        "Excellent communication and interpersonal skills",
        "Patience and enthusiasm for teaching people of all ages",
        "Physical fitness and ability to ski all day in varying conditions",
        "Must be at least 18 years old",
        "CPR and First Aid certification preferred",
        "Pass background check"
      ],
      "benefits": [
        "Free unlimited skiing at Mountain Ridge",
        "Season pass benefits at partner resorts nationwide",
        "Pro-deal discounts on ski equipment and apparel",
        "PSIA certification training and exam fees covered",
        "Discounted employee housing (limited availability)",
        "Free ski equipment demo program",
        "Employee cafeteria discounts",
        "Opportunity to ski and teach in beautiful mountain environment"
      ],
      "salary_min": 17.00,
      "salary_max": 25.00,
      "pay_period": "Hourly (varies by certification level and experience)",
      "relocation_required": null
    },
    {
      "id": 33,
      "company_name": "NextGen Pharmaceuticals",
      "company_description": "NextGen Pharmaceuticals is a biopharmaceutical company developing novel therapies for oncology and rare diseases. With three drugs in Phase II clinical trials and $200M in recent funding, we're poised for significant growth.",
      "position_title": "Clinical Research Associate",
      "job_type": "Full Time",
      "location": "Hybrid in San Diego, CA (40% travel to clinical sites)",
      "position_summary": "NextGen seeks a Clinical Research Associate to monitor clinical trials and ensure compliance with protocols, GCP guidelines, and regulatory requirements. You'll work with investigative sites conducting our Phase II oncology trials.",
      "primary_responsibilities": [
        "Monitor clinical trial sites to ensure protocol compliance and data quality",
        "Review informed consent forms, source documents, and case report forms",
        "Verify accuracy and completeness of clinical data",
        "Ensure investigator site compliance with GCP, FDA regulations, and protocols",
        "Conduct site initiation, interim monitoring, and closeout visits",
        "Review and track adverse events and protocol deviations",
        "Communicate regularly with site coordinators and principal investigators",
        "Prepare detailed monitoring reports and follow-up letters",
        "Assist with site selection and qualification",
        "Track enrollment and help sites meet recruitment goals",
        "Maintain clinical trial master files and documentation"
      ],
      "requirements": [
        "Bachelor's degree in Life Sciences, Nursing, or related field required",
        "2-4 years of clinical monitoring experience required",
        "Strong knowledge of GCP, FDA regulations (21 CFR Part 11, 50, 56, 312), and ICH guidelines",
        "Experience monitoring oncology trials strongly preferred",
        "Excellent attention to detail and organizational skills",
        "Strong written and verbal communication abilities",
        "Ability to travel 40-50% (domestic and occasional international)",
        "Proficiency with electronic data capture systems (Medidata, Oracle)",
        "ACRP or SoCRA certification preferred",
        "Self-motivated with ability to work independently"
      ],
      "benefits": [
        "Competitive salary with annual bonuses",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with 6% match",
        "Stock options",
        "Generous PTO and flexible work arrangements",
        "Professional development and certification support",
        "Travel expenses fully reimbursed",
        "Company laptop and cell phone",
        "Collaborative biotech environment",
        "Opportunity to contribute to life-saving therapies"
      ],
      "salary_min": 75000,
      "salary_max": 95000,
      "pay_period": "Annual",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 34,
      "company_name": "Heritage Public Library",
      "company_description": "Heritage Public Library serves a community of 75,000 residents with a main library and two branches. We offer diverse collections, programs for all ages, technology access, and community meeting spaces.",
      "position_title": "Reference Librarian",
      "job_type": "Full Time",
      "location": "On-site in Ann Arbor, MI",
      "position_summary": "Heritage Public Library is seeking a Reference Librarian to assist patrons with research needs, readers' advisory, and technology questions. You'll provide excellent customer service while helping community members access information and resources.",
      "primary_responsibilities": [
        "Assist patrons with reference questions using print and electronic resources",
        "Provide readers' advisory and book recommendations",
        "Conduct research instruction and information literacy training",
        "Help patrons with technology including computers, databases, and e-resources",
        "Develop and present programs for adult and teen audiences",
        "Create research guides and library marketing materials",
        "Manage collection development for assigned subject areas",
        "Staff reference desk including some evenings and weekends",
        "Participate in outreach activities and community events",
        "Collaborate with colleagues on library initiatives and projects",
        "Stay current on library trends and emerging technologies"
      ],
      "requirements": [
        "Master's degree in Library Science (MLS/MLIS) from ALA-accredited program required",
        "1-3 years of reference or public library experience preferred",
        "Strong knowledge of reference sources, databases, and search strategies",
        "Excellent customer service and interpersonal skills",
        "Experience with integrated library systems (Sierra, Polaris, etc.)",
        "Ability to teach technology skills to diverse audiences",
        "Strong communication and presentation abilities",
        "Commitment to intellectual freedom and patron privacy",
        "Flexibility to work evenings and weekends",
        "Enthusiasm for public service and lifelong learning"
      ],
      "benefits": [
        "Competitive salary with step increases",
        "Comprehensive benefits including health, dental, and vision",
        "Generous retirement plan (MERS)",
        "4 weeks vacation plus sick time",
        "12 paid holidays plus library closure days",
        "Professional development opportunities and conference attendance",
        "Tuition reimbursement",
        "Collaborative, mission-driven work environment"
      ],
      "salary_min": 52000,
      "salary_max": 62000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 35,
      "company_name": "Precision Dental Lab",
      "company_description": "Precision Dental Lab is a full-service dental laboratory creating custom crowns, bridges, dentures, and implant restorations for dentists throughout the region. We combine traditional craftsmanship with digital technology.",
      "position_title": "Dental Technician - Crown & Bridge",
      "job_type": "Full Time",
      "location": "On-site in Phoenix, AZ",
      "position_summary": "Precision Dental Lab seeks an experienced Dental Technician specializing in crown and bridge fabrication. You'll create high-quality restorations using both traditional and CAD/CAM techniques in our modern laboratory.",
      "primary_responsibilities": [
        "Fabricate metal-ceramic and all-ceramic crowns and bridges",
        "Pour and trim dental models from impressions",
        "Wax up crown and bridge restorations",
        "Apply porcelain and adjust occlusion",
        "Finish and polish restorations to high aesthetic standards",
        "Shade match restorations to natural dentition",
        "Work with digital workflows including intraoral scans",
        "Communicate with dentists regarding case specifications and shade",
        "Maintain quality control standards and meet deadlines",
        "Keep work area clean and organized",
        "Maintain and care for equipment and instruments"
      ],
      "requirements": [
        "Dental technician training from accredited program or equivalent apprenticeship",
        "3-5 years of experience in crown and bridge fabrication",
        "CDT (Certified Dental Technician) credential preferred",
        "Strong knowledge of dental anatomy, occlusion, and materials",
        "Experience with porcelain layering and finishing techniques",
        "Familiarity with CAD/CAM technology (3Shape, exocad) a plus",
        "Excellent hand-eye coordination and attention to detail",
        "Good color perception and aesthetic sense",
        "Ability to work independently and meet production goals",
        "Strong communication skills for case discussions with dentists"
      ],
      "benefits": [
        "Competitive salary based on experience and skill level",
        "Health and dental insurance (free dental care at partner offices)",
        "401(k) retirement plan",
        "Paid time off and holidays",
        "Continuing education opportunities",
        "Modern equipment and materials",
        "Stable, established laboratory with loyal client base"
      ],
      "salary_min": 50000,
      "salary_max": 70000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 36,
      "company_name": "Evergreen Environmental Consulting",
      "company_description": "Evergreen Environmental is a consulting firm specializing in environmental site assessments, remediation oversight, and regulatory compliance for commercial and industrial clients throughout the Pacific Northwest.",
      "position_title": "Environmental Scientist",
      "job_type": "Full Time",
      "location": "Hybrid in Seattle, WA (field work 30-40%)",
      "position_summary": "Evergreen seeks an Environmental Scientist to conduct Phase I and II environmental site assessments, soil and groundwater sampling, and support remediation projects. You'll work on diverse projects while developing technical and client management skills.",
      "primary_responsibilities": [
        "Conduct Phase I Environmental Site Assessments following ASTM standards",
        "Perform Phase II investigations including soil and groundwater sampling",
        "Oversee drilling contractors and field technicians",
        "Prepare technical reports, work plans, and regulatory submittals",
        "Review historical records, aerial photos, and regulatory databases",
        "Communicate with clients, regulators, and stakeholders",
        "Manage project budgets and schedules",
        "Ensure health and safety compliance during field work",
        "Assist with remediation system design and monitoring",
        "Support business development and proposal preparation"
      ],
      "requirements": [
        "Bachelor's degree in Environmental Science, Geology, or related field required",
        "2-4 years of environmental consulting experience",
        "Knowledge of ASTM Phase I/II standards and CERCLA/RCRA regulations",
        "Experience with soil and groundwater sampling techniques",
        "Strong technical writing and report preparation skills",
        "Proficiency with GIS software and data analysis tools",
        "40-hour HAZWOPER certification required",
        "Valid driver's license and ability to travel within region",
        "Ability to perform physical field work in various weather conditions",
        "Professional Geologist (PG) license or ability to obtain preferred",
        "Excellent organizational and project management skills"
      ],
      "benefits": [
        "Competitive salary with annual merit increases",
        "Performance bonuses",
        "Comprehensive health benefits",
        "401(k) with company match",
        "Flexible hybrid schedule",
        "Company vehicle for field work",
        "Professional development and licensure support",
        "Conference attendance opportunities",
        "Collaborative work environment with diverse projects"
      ],
      "salary_min": 65000,
      "salary_max": 80000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 37,
      "company_name": "Riverside Animal Hospital",
      "company_description": "Riverside Animal Hospital is a full-service veterinary clinic providing comprehensive care for dogs and cats. Our experienced team offers wellness exams, surgery, dentistry, and emergency care in a compassionate environment.",
      "position_title": "Veterinary Technician",
      "job_type": "Full Time",
      "location": "On-site in Madison, WI",
      "position_summary": "Riverside Animal Hospital is seeking a skilled Veterinary Technician to support our veterinarians and provide high-quality patient care. You'll assist with examinations, surgeries, diagnostics, and client communication in our busy small animal practice.",
      "primary_responsibilities": [
        "Assist veterinarians with physical examinations and procedures",
        "Administer medications, vaccines, and treatments as directed",
        "Perform venipuncture and place IV catheters",
        "Prepare patients and assist with surgical procedures",
        "Monitor anesthesia and recovery",
        "Perform laboratory tests including blood work, urinalysis, and fecal exams",
        "Take and develop radiographs",
        "Maintain medical records and treatment sheets accurately",
        "Communicate with clients regarding patient care and instructions",
        "Restrain animals safely and humanely",
        "Maintain clean and organized treatment and surgical areas",
        "Educate clients on preventive care and pet health"
      ],
      "requirements": [
        "Graduate of AVMA-accredited veterinary technology program",
        "Wisconsin Certified Veterinary Technician (CVT) license required",
        "1-3 years of veterinary experience preferred",
        "Strong technical skills in venipuncture, anesthesia monitoring, and radiology",
        "Knowledge of veterinary pharmaceuticals and treatments",
        "Excellent animal handling and restraint abilities",
        "Compassionate patient care and strong client communication skills",
        "Ability to work efficiently in fast-paced environment",
        "Physical ability to lift and restrain animals (up to 50 lbs)",
        "Flexibility to work some weekends and occasional evenings"
      ],
      "benefits": [
        "Competitive salary based on experience",
        "Health and dental insurance",
        "Employee pet care discount",
        "Paid time off and holidays",
        "Continuing education allowance",
        "Uniform allowance",
        "Supportive, team-oriented environment",
        "Opportunities for skill development"
      ],
      "salary_min": 19.00,
      "salary_max": 24.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 38,
      "company_name": "Global Freight Solutions",
      "company_description": "Global Freight Solutions is an international freight forwarder handling air, ocean, and ground transportation for importers and exporters. We coordinate shipments to over 150 countries and provide customs brokerage services.",
      "position_title": "Import/Export Coordinator",
      "job_type": "Full Time",
      "location": "On-site in Los Angeles, CA",
      "position_summary": "Global Freight Solutions seeks an Import/Export Coordinator to manage international shipments and coordinate logistics for our clients. You'll work with carriers, customs brokers, and clients to ensure timely, compliant movement of goods.",
      "primary_responsibilities": [
        "Coordinate ocean and air freight shipments from origin to destination",
        "Obtain quotes from carriers and provide pricing to clients",
        "Prepare shipping documentation including bills of lading, commercial invoices, and packing lists",
        "Track shipments and provide status updates to clients",
        "Coordinate customs clearance with customs brokers",
        "Ensure compliance with import/export regulations and Incoterms",
        "Resolve shipping delays, damages, and discrepancies",
        "Communicate with overseas agents and carriers",
        "Enter shipment data into operating system accurately",
        "Calculate duties, taxes, and freight charges",
        "Build and maintain relationships with clients and vendors",
        "Handle multiple shipments simultaneously and meet deadlines"
      ],
      "requirements": [
        "Bachelor's degree preferred or equivalent experience",
        "2-4 years of freight forwarding or logistics experience",
        "Knowledge of international shipping procedures and documentation",
        "Understanding of Incoterms, customs regulations, and trade compliance",
        "Strong organizational and multitasking abilities",
        "Excellent communication skills (written and verbal)",
        "Proficiency with Microsoft Office and logistics software",
        "Detail-oriented with high accuracy in documentation",
        "Customer service mindset and problem-solving skills",
        "Ability to work under pressure and meet tight deadlines",
        "Licensed Customs Broker a plus"
      ],
      "benefits": [
        "Competitive salary",
        "Health, dental, and vision insurance",
        "401(k) retirement plan",
        "Paid time off and holidays",
        "Professional development opportunities",
        "Bonus opportunities based on performance",
        "Dynamic, international work environment"
      ],
      "salary_min": 50000,
      "salary_max": 62000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 39,
      "company_name": "Innovate Design Studio",
      "company_description": "Innovate Design Studio is a creative agency specializing in brand identity, web design, and digital marketing. Our 15-person team works with startups and established companies to create compelling visual experiences.",
      "position_title": "Graphic Designer",
      "job_type": "Full Time",
      "location": "Hybrid in Austin, TX (2 days in office)",
      "position_summary": "Innovate Design Studio is seeking a talented Graphic Designer to create engaging visual content across multiple platforms. You'll work on diverse projects from brand identity to digital campaigns, collaborating with our creative team.",
      "primary_responsibilities": [
        "Design marketing materials including brochures, presentations, and advertisements",
        "Create social media graphics and digital content",
        "Develop brand identity systems including logos, color palettes, and style guides",
        "Design website mockups and user interfaces",
        "Prepare print-ready files and coordinate with vendors",
        "Collaborate with copywriters, account managers, and developers",
        "Present design concepts to clients and incorporate feedback",
        "Maintain brand consistency across all client materials",
        "Manage multiple projects and meet deadlines",
        "Stay current on design trends and software capabilities"
      ],
      "requirements": [
        "Bachelor's degree in Graphic Design or related field",
        "2-4 years of professional design experience",
        "Expert proficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign)",
        "Strong portfolio demonstrating range of design work",
        "Understanding of typography, color theory, and layout principles",
        "Experience with web design and UI/UX concepts",
        "Knowledge of print production processes",
        "Excellent visual communication skills",
        "Ability to take creative direction and work collaboratively",
        "Strong time management and organizational abilities",
        "Experience with Figma or Sketch a plus"
      ],
      "benefits": [
        "Competitive salary",
        "Health and dental insurance",
        "401(k) plan",
        "Flexible hybrid schedule",
        "PTO and paid holidays",
        "Professional development budget",
        "Creative, collaborative work environment",
        "Latest design software and equipment",
        "Casual dress code"
      ],
      "salary_min": 55000,
      "salary_max": 70000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 40,
      "company_name": "PowerGrid Electric Cooperative",
      "company_description": "PowerGrid Electric Cooperative is a member-owned utility serving 45,000 customers across rural counties. We provide reliable, affordable electricity while maintaining miles of distribution lines and supporting our communities.",
      "position_title": "Journeyman Lineman",
      "job_type": "Full Time",
      "location": "On-site in Great Falls, MT",
      "position_summary": "PowerGrid seeks experienced Journeyman Linemen to construct, maintain, and repair overhead and underground electrical distribution systems. You'll work outdoors in all weather conditions ensuring safe, reliable power delivery to our member-owners.",
      "primary_responsibilities": [
        "Install, maintain, and repair overhead and underground power lines",
        "Climb poles and work from bucket trucks at heights up to 60 feet",
        "Read and interpret electrical diagrams and blueprints",
        "Perform switching operations to isolate circuits for maintenance",
        "Respond to power outages and emergency repairs (on-call rotation)",
        "Install transformers, regulators, and other electrical equipment",
        "Trim trees and vegetation near power lines",
        "Operate heavy equipment including digger derricks and trenchers",
        "Follow all safety procedures and OSHA regulations",
        "Maintain tools, equipment, and vehicles",
        "Work as part of crew to complete projects efficiently",
        "Document work performed and materials used"
      ],
      "requirements": [
        "High school diploma or equivalent required",
        "Journeyman Lineman certification or completion of accredited apprenticeship program",
        "Minimum 4 years of lineman experience",
        "Valid CDL Class A license required",
        "Ability to work at heights and in confined spaces",
        "Strong knowledge of electrical theory and safety practices",
        "Physical ability to lift 75+ lbs and perform demanding outdoor work",
        "Willingness to work overtime, weekends, and on-call as needed",
        "Ability to work in extreme weather conditions",
        "Strong teamwork and communication skills",
        "First Aid/CPR certification preferred"
      ],
      "benefits": [
        "Excellent wages with overtime opportunities",
        "Comprehensive health, dental, and vision insurance",
        "Pension plan plus 401(k) with employer match",
        "Company vehicle and equipment provided",
        "Generous paid time off",
        "Annual boot and clothing allowance",
        "Ongoing training and certification opportunities",
        "Job security with member-owned cooperative",
        "Life and disability insurance"
      ],
      "salary_min": 38.00,
      "salary_max": 45.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 41,
      "company_name": "Coastal Realty Group",
      "company_description": "Coastal Realty Group is a boutique real estate brokerage specializing in luxury coastal properties. Our experienced agents serve buyers and sellers in the Charleston area with personalized, high-touch service.",
      "position_title": "Real Estate Agent",
      "job_type": "Full Time - Commission",
      "location": "On-site in Charleston, SC",
      "position_summary": "Coastal Realty Group is seeking motivated Real Estate Agents to join our team. We provide leads, marketing support, and mentorship while you build your business helping clients buy and sell coastal properties.",
      "primary_responsibilities": [
        "Prospect for and develop new client relationships",
        "Represent buyers in property searches and purchase negotiations",
        "List and market properties for sellers",
        "Conduct property showings and open houses",
        "Prepare and present offers, counteroffers, and purchase agreements",
        "Negotiate contracts to achieve best outcomes for clients",
        "Coordinate inspections, appraisals, and closing processes",
        "Stay informed on local real estate market trends and inventory",
        "Maintain MLS listings with accurate information and photos",
        "Build referral network and maintain client relationships",
        "Utilize CRM system to track leads and transactions",
        "Participate in office meetings and training"
      ],
      "requirements": [
        "Active South Carolina real estate license required",
        "Previous real estate sales experience preferred but not required",
        "Strong interpersonal and communication skills",
        "Self-motivated with entrepreneurial mindset",
        "Excellent negotiation and problem-solving abilities",
        "Professional appearance and demeanor",
        "Valid driver's license and reliable transportation",
        "Flexibility to work evenings and weekends",
        "Knowledge of local area and coastal communities a plus",
        "Tech-savvy with social media marketing skills"
      ],
      "benefits": [
        "Competitive commission splits (60-80% depending on production)",
        "Company-provided leads",
        "Professional marketing materials and photography",
        "Modern office space and administrative support",
        "Mentorship program for new agents",
        "Access to MLS and real estate technology platforms",
        "Health insurance stipend for high producers",
        "Collaborative team environment",
        "Professional development and training"
      ],
      "salary_min": 45000,
      "salary_max": 150000,
      "pay_period": "Annual (commission-based, income varies by production)",
      "relocation_required": null
    },
    {
      "id": 42,
      "company_name": "Valley Community Foundation",
      "company_description": "Valley Community Foundation is a nonprofit organization managing charitable funds and grants for donors throughout the region. We've distributed over $50M to local nonprofits supporting education, health, arts, and human services.",
      "position_title": "Program Officer",
      "job_type": "Full Time",
      "location": "Hybrid in Springfield, MA (3 days in office)",
      "position_summary": "Valley Community Foundation seeks a Program Officer to manage grantmaking programs, conduct site visits, and build relationships with nonprofit partners. You'll help deploy philanthropic dollars strategically to create community impact.",
      "primary_responsibilities": [
        "Review grant applications and make funding recommendations",
        "Conduct site visits to nonprofit organizations and assess programs",
        "Develop and manage grantmaking initiatives in assigned focus areas",
        "Build relationships with nonprofit leaders and community stakeholders",
        "Monitor grant outcomes and collect impact data",
        "Prepare grant reports and presentations for board committees",
        "Organize donor site visits and engagement opportunities",
        "Provide technical assistance to nonprofit grantees",
        "Research community needs and philanthropic trends",
        "Represent Foundation at community meetings and events",
        "Collaborate with Development team on donor relations"
      ],
      "requirements": [
        "Bachelor's degree required; Master's in Nonprofit Management, Public Administration, or related field preferred",
        "3-5 years of experience in nonprofit sector, grantmaking, or community development",
        "Knowledge of nonprofit operations, program evaluation, and community issues",
        "Strong analytical and critical thinking skills",
        "Excellent written and verbal communication abilities",
        "Ability to build relationships across diverse communities",
        "Experience with grants management systems",
        "Understanding of equity and inclusion principles in philanthropy",
        "Valid driver's license for local travel to site visits",
        "Passion for community development and social impact"
      ],
      "benefits": [
        "Competitive nonprofit salary",
        "Comprehensive health and dental insurance",
        "403(b) retirement plan with employer contribution",
        "Generous PTO (4 weeks) plus paid holidays",
        "Flexible hybrid work schedule",
        "Professional development opportunities",
        "Meaningful work supporting community causes",
        "Collaborative organizational culture"
      ],
      "salary_min": 58000,
      "salary_max": 72000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 43,
      "company_name": "Metro Transit Authority",
      "company_description": "Metro Transit Authority operates bus and light rail services throughout the metropolitan area, providing 200,000 daily trips. We're committed to safe, reliable, sustainable public transportation that connects communities.",
      "position_title": "Bus Operator",
      "job_type": "Full Time",
      "location": "On-site in Minneapolis, MN",
      "position_summary": "Metro Transit is hiring Bus Operators to safely transport passengers on fixed routes throughout the metro area. We provide comprehensive paid training (6-8 weeks) for individuals committed to public service and safety.",
      "primary_responsibilities": [
        "Operate buses safely on assigned routes following schedules",
        "Provide excellent customer service to diverse ridership",
        "Collect fares and assist passengers with route information",
        "Ensure passenger safety and follow all traffic laws",
        "Perform pre-trip and post-trip vehicle inspections",
        "Report mechanical issues and accidents promptly",
        "Assist passengers with disabilities and mobility devices",
        "Maintain professional demeanor in challenging situations",
        "Complete required reports and paperwork accurately",
        "Follow all Metro Transit policies and procedures",
        "Communicate with dispatch and operations center"
      ],
      "requirements": [
        "High school diploma or equivalent",
        "Valid driver's license with good driving record (3+ years)",
        "Ability to obtain CDL Class B with Passenger and Air Brake endorsements",
        "Must be at least 21 years old",
        "Pass background check, drug screening, and DOT physical",
        "Strong customer service skills and patience with public",
        "Ability to work various shifts including early mornings, evenings, weekends, and holidays",
        "Physical ability to sit for extended periods and assist passengers",
        "Good vision and hearing",
        "Ability to handle stressful situations calmly",
        "Basic math skills for fare collection",
        "Reliable attendance essential"
      ],
      "benefits": [
        "Starting wage $24.50/hour with regular increases",
        "Comprehensive health, dental, and vision insurance",
        "Pension plan plus 457(b) retirement savings",
        "Free transit pass for employee and family",
        "Paid training program (6-8 weeks)",
        "Generous paid time off and holidays",
        "Uniform provided",
        "Union representation",
        "Job security with public agency",
        "Advancement opportunities"
      ],
      "salary_min": 24.50,
      "salary_max": 32.00,
      "pay_period": "Hourly (increases with seniority)",
      "relocation_required": null
    },
    {
      "id": 44,
      "company_name": "CloudScale Technologies",
      "company_description": "CloudScale Technologies provides cloud infrastructure and DevOps consulting services to enterprise clients. Our team of 100+ engineers helps Fortune 500 companies migrate to cloud, implement automation, and optimize their infrastructure.",
      "position_title": "DevOps Engineer",
      "job_type": "Full Time",
      "location": "Remote (US only)",
      "position_summary": "CloudScale is seeking a DevOps Engineer to design and implement CI/CD pipelines, infrastructure as code, and monitoring solutions for our enterprise clients. You'll work with cutting-edge cloud technologies in a fully remote environment.",
      "primary_responsibilities": [
        "Design and implement CI/CD pipelines using Jenkins, GitLab CI, or similar tools",
        "Develop infrastructure as code using Terraform, CloudFormation, or Ansible",
        "Manage and optimize cloud infrastructure (AWS, Azure, or GCP)",
        "Implement monitoring and logging solutions using tools like Prometheus, Grafana, ELK",
        "Automate deployment processes and system configurations",
        "Troubleshoot production issues and perform root cause analysis",
        "Implement security best practices and compliance requirements",
        "Collaborate with development teams to improve deployment processes",
        "Document architecture, processes, and runbooks",
        "Participate in on-call rotation for production support",
        "Mentor junior engineers and share knowledge with team"
      ],
      "requirements": [
        "Bachelor's degree in Computer Science or related field (or equivalent experience)",
        "3-5 years of DevOps or systems engineering experience",
        "Strong experience with AWS, Azure, or GCP",
        "Proficiency with containerization (Docker, Kubernetes)",
        "Experience with Infrastructure as Code tools (Terraform, CloudFormation)",
        "Strong scripting skills (Python, Bash, or PowerShell)",
        "Knowledge of CI/CD tools and best practices",
        "Understanding of networking, security, and system administration",
        "Experience with monitoring and logging tools",
        "Excellent problem-solving and troubleshooting skills",
        "Strong communication skills for client interactions",
        "AWS/Azure/GCP certifications preferred"
      ],
      "benefits": [
        "Competitive salary with annual bonuses",
        "100% remote work with flexible hours",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with 5% match",
        "Unlimited PTO policy",
        "$3,000 annual professional development budget",
        "Certification exam reimbursement",
        "Home office equipment stipend",
        "Latest technology and tools",
        "Collaborative team culture with regular virtual events"
      ],
      "salary_min": 105000,
      "salary_max": 140000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 45,
      "company_name": "Harmony Montessori School",
      "company_description": "Harmony Montessori is an authentic Montessori school serving children ages 18 months through 6th grade. Our experienced, AMI/AMS certified guides create prepared environments where children develop independence, curiosity, and love of learning.",
      "position_title": "Montessori Guide - Primary (Ages 3-6)",
      "job_type": "Full Time",
      "location": "On-site in Boulder, CO",
      "position_summary": "Harmony Montessori seeks an AMI or AMS certified Primary Guide to lead our 3-6 classroom. You'll create a prepared environment, guide children's individual learning paths, and collaborate with families in our supportive school community.",
      "primary_responsibilities": [
        "Prepare and maintain Montessori classroom environment following AMI/AMS standards",
        "Present Montessori materials and lessons across all curriculum areas",
        "Observe children and maintain detailed records of progress",
        "Guide individual children's learning and development",
        "Foster independence, concentration, and social-emotional growth",
        "Communicate regularly with parents through conferences and reports",
        "Collaborate with assistant and support staff",
        "Maintain classroom order and peaceful atmosphere",
        "Plan and implement grace and courtesy lessons",
        "Participate in school events, parent education, and staff meetings",
        "Continue professional development in Montessori education"
      ],
      "requirements": [
        "AMI or AMS Primary (3-6) Montessori credential required",
        "Bachelor's degree required; degree in education preferred",
        "2+ years of Montessori teaching experience preferred",
        "Deep understanding of Montessori philosophy and method",
        "Patience, warmth, and genuine respect for children",
        "Excellent observation and child assessment skills",
        "Strong communication skills with children, families, and colleagues",
        "Physical ability to work at children's level (sitting, kneeling, lifting)",
        "CPR and First Aid certification",
        "Background check clearance"
      ],
      "benefits": [
        "Competitive salary for Montessori education",
        "Health insurance with school contribution",
        "Retirement plan",
        "Tuition discount for employee's children (75%)",
        "Generous school holiday breaks",
        "Professional development support",
        "Beautiful, well-resourced classroom",
        "Supportive parent community and administration",
        "Opportunity to practice authentic Montessori"
      ],
      "salary_min": 45000,
      "salary_max": 58000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 46,
      "company_name": "Precision Auto Body",
      "company_description": "Precision Auto Body is a family-owned collision repair shop serving the community for 30 years. We're I-CAR Gold Class certified and work with all major insurance companies to restore vehicles to pre-accident condition.",
      "position_title": "Auto Body Technician",
      "job_type": "Full Time",
      "location": "On-site in Toledo, OH",
      "position_summary": "Precision Auto Body is hiring skilled Auto Body Technicians to perform collision repair work including metal work, panel replacement, and finish preparation. You'll work in our modern shop with the latest equipment and technology.",
      "primary_responsibilities": [
        "Repair and replace damaged body panels, fenders, doors, and bumpers",
        "Perform metal straightening, welding, and panel alignment",
        "Remove and install mechanical and electrical components as needed",
        "Use frame machines and measuring systems to restore structural integrity",
        "Prepare surfaces for painting including sanding and priming",
        "Follow repair procedures and manufacturer specifications",
        "Work efficiently to meet production and quality standards",
        "Maintain clean and organized work area",
        "Communicate with service advisor regarding repairs and timelines",
        "Follow safety procedures and use PPE appropriately"
      ],
      "requirements": [
        "High school diploma or equivalent",
        "3+ years of auto body repair experience",
        "I-CAR or ASE certification preferred",
        "Proficiency with MIG welding and panel bonding",
        "Experience with aluminum repair a plus",
        "Knowledge of vehicle structure and repair techniques",
        "Ability to use hand and power tools proficiently",
        "Physical ability to lift 50 lbs and work in various positions",
        "Attention to detail and quality workmanship",
        "Own basic hand tools",
        "Valid driver's license"
      ],
      "benefits": [
        "Competitive flat-rate or hourly compensation",
        "Health insurance",
        "401(k) plan",
        "Paid holidays and vacation",
        "Ongoing training and certification opportunities",
        "Tool allowance/purchase program",
        "Climate-controlled shop",
        "Modern equipment and technology",
        "Stable, established business"
      ],
      "salary_min": 22.00,
      "salary_max": 35.00,
      "pay_period": "Hourly or flat-rate",
      "relocation_required": null
    },
    {
      "id": 47,
      "company_name": "Midwest Energy Corporation",
      "company_description": "Midwest Energy is a diversified energy company operating natural gas distribution, electric generation, and renewable energy assets. We serve 2 million customers across six states with a workforce of 8,000 employees.",
      "position_title": "Substation Engineer",
      "job_type": "Full Time",
      "location": "Hybrid in Omaha, NE (3 days in office)",
      "position_summary": "Midwest Energy seeks a Substation Engineer to design, specify, and oversee construction of electrical substations and associated equipment. You'll work on projects ranging from equipment upgrades to new substation construction.",
      "primary_responsibilities": [
        "Design electrical substation layouts, one-line diagrams, and protection schemes",
        "Develop specifications for substation equipment including transformers, breakers, and relays",
        "Prepare cost estimates and project budgets",
        "Review vendor drawings and equipment submittals",
        "Coordinate with construction contractors and oversee installation",
        "Perform relay settings calculations and protection coordination studies",
        "Conduct site investigations and field inspections",
        "Ensure designs meet NERC, IEEE, and NESC standards",
        "Prepare technical reports and engineering documentation",
        "Support commissioning and testing of new installations",
        "Provide technical guidance to operations and maintenance staff",
        "Manage multiple projects simultaneously"
      ],
      "requirements": [
        "Bachelor's degree in Electrical Engineering required",
        "Professional Engineer (PE) license preferred or ability to obtain",
        "3-5 years of substation engineering experience",
        "Strong knowledge of substation design, protection, and control systems",
        "Proficiency with AutoCAD and electrical engineering software",
        "Understanding of power system analysis and protection coordination",
        "Experience with relay programming (SEL, GE, ABB) preferred",
        "Knowledge of utility standards and regulations",
        "Excellent project management and organizational skills",
        "Strong communication and teamwork abilities",
        "Willingness to travel to project sites (20-30%)"
      ],
      "benefits": [
        "Competitive salary with annual merit increases",
        "Performance-based annual bonus",
        "Comprehensive health, dental, and vision insurance",
        "Pension plan plus 401(k) with 6% match",
        "4 weeks PTO plus paid holidays",
        "Professional development and PE license support",
        "Tuition reimbursement",
        "Company vehicle for field work",
        "Work-life balance with hybrid schedule",
        "Stable utility industry career"
      ],
      "salary_min": 85000,
      "salary_max": 110000,
      "pay_period": "Annual",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 48,
      "company_name": "FreshMart Grocery",
      "company_description": "FreshMart is a regional grocery chain with 45 stores known for quality products, competitive prices, and community involvement. We employ over 3,000 team members dedicated to providing excellent customer service.",
      "position_title": "Assistant Store Manager",
      "job_type": "Full Time",
      "location": "On-site in Birmingham, AL",
      "position_summary": "FreshMart is seeking an experienced Assistant Store Manager to help oversee daily operations of our high-volume store. You'll support the Store Manager in leading the team, driving sales, and ensuring excellent customer experiences.",
      "primary_responsibilities": [
        "Assist Store Manager with overall store operations and department management",
        "Lead and motivate team of 50+ employees across all departments",
        "Ensure outstanding customer service and resolve escalated issues",
        "Monitor inventory levels and coordinate ordering",
        "Oversee merchandising, pricing, and promotional displays",
        "Manage schedules and ensure adequate staffing levels",
        "Train and develop department managers and associates",
        "Monitor sales performance and implement strategies to achieve goals",
        "Ensure compliance with food safety and sanitation standards",
        "Conduct employee performance reviews and address personnel issues",
        "Manage store opening or closing procedures",
        "Step in as Manager on Duty as needed"
      ],
      "requirements": [
        "5+ years of retail management experience, preferably in grocery",
        "Proven track record of leading teams and driving results",
        "Strong understanding of P&L, labor management, and inventory control",
        "Excellent leadership and interpersonal skills",
        "Customer service-oriented mindset",
        "Ability to work flexible schedule including nights, weekends, and holidays",
        "Strong problem-solving and decision-making abilities",
        "Physical ability to stand for extended periods and lift 50 lbs",
        "Proficiency with retail management systems",
        "High school diploma required; Bachelor's degree preferred",
        "Food safety certification"
      ],
      "benefits": [
        "Competitive salary with quarterly bonus potential",
        "Comprehensive health benefits",
        "401(k) with company match",
        "Paid vacation and sick time",
        "Employee discount (20%)",
        "Advancement opportunities within growing company",
        "Management training programs",
        "Life and disability insurance"
      ],
      "salary_min": 55000,
      "salary_max": 68000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 49,
      "company_name": "Northstar Architecture",
      "company_description": "Northstar Architecture is an award-winning firm specializing in sustainable residential and commercial design. Our 20-person studio has completed over 300 projects and is committed to environmentally responsible architecture.",
      "position_title": "Architect",
      "job_type": "Full Time",
      "location": "Hybrid in Portland, OR (3 days in office)",
      "position_summary": "Northstar seeks a licensed Architect to work on residential and small commercial projects from concept through construction administration. You'll collaborate with our design team, clients, and consultants to create beautiful, sustainable buildings.",
      "primary_responsibilities": [
        "Develop architectural designs from schematic design through construction documents",
        "Create drawings, renderings, and presentations for client meetings",
        "Coordinate with structural, mechanical, and civil engineers",
        "Conduct code research and ensure compliance with building regulations",
        "Prepare permit application documents",
        "Respond to RFIs and review shop drawings during construction",
        "Conduct site observations and document construction progress",
        "Manage project budgets and schedules",
        "Mentor junior designers and interns",
        "Participate in sustainable design initiatives (LEED, Passive House)",
        "Contribute to business development and client presentations"
      ],
      "requirements": [
        "Professional degree in Architecture (B.Arch or M.Arch)",
        "Licensed Architect registered in Oregon (or ability to obtain through reciprocity)",
        "4-7 years of professional experience post-licensure",
        "Proficiency with Revit, AutoCAD, and Adobe Creative Suite",
        "Strong design sensibility and technical knowledge",
        "Experience with residential or commercial projects",
        "Knowledge of sustainable design principles and green building",
        "Excellent communication and presentation skills",
        "Ability to manage multiple projects simultaneously",
        "Strong attention to detail and quality",
        "LEED AP certification preferred"
      ],
      "benefits": [
        "Competitive salary commensurate with experience",
        "Health, dental, and vision insurance",
        "401(k) with company match",
        "Flexible hybrid schedule",
        "3 weeks PTO plus paid holidays",
        "Professional development and continuing education support",
        "AIA membership dues paid",
        "Bike commuter benefits",
        "Collaborative, design-focused studio culture"
      ],
      "salary_min": 75000,
      "salary_max": 95000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 50,
      "company_name": "Summit Physical Therapy",
      "company_description": "Summit Physical Therapy operates eight outpatient clinics providing orthopedic, sports, and manual therapy services. Our evidence-based approach and personalized care have made us a trusted healthcare provider in the region.",
      "position_title": "Physical Therapist",
      "job_type": "Full Time",
      "location": "On-site in Salt Lake City, UT",
      "position_summary": "Summit Physical Therapy seeks a skilled Physical Therapist to evaluate and treat patients with orthopedic and sports-related injuries. You'll work in a collaborative environment with mentorship opportunities and a strong focus on patient outcomes.",
      "primary_responsibilities": [
        "Conduct comprehensive physical therapy evaluations",
        "Develop and implement evidence-based treatment plans",
        "Provide manual therapy, therapeutic exercise, and modality treatments",
        "Educate patients on home exercise programs and injury prevention",
        "Document evaluations, daily notes, and discharge summaries accurately",
        "Monitor patient progress and adjust treatment plans as needed",
        "Communicate with physicians and other healthcare providers",
        "Maintain productivity standards while ensuring quality care",
        "Mentor students and new therapists",
        "Participate in continuing education and quality improvement initiatives",
        "Build positive relationships with patients and referral sources"
      ],
      "requirements": [
        "Doctor of Physical Therapy (DPT) degree from accredited program",
        "Utah state PT license in good standing",
        "Strong clinical reasoning and manual therapy skills",
        "Knowledge of evidence-based orthopedic interventions",
        "Excellent interpersonal and communication abilities",
        "Ability to work independently and as part of collaborative team",
        "Commitment to continuing education and professional development",
        "CPR certification",
        "New graduates welcome with mentorship program"
      ],
      "benefits": [
        "Competitive salary based on experience",
        "Sign-on bonus for experienced PTs ($5,000)",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with company match",
        "Generous PTO and paid holidays",
        "Continuing education allowance ($1,500 annually)",
        "APTA membership and licensure fees paid",
        "Mentorship and professional development opportunities",
        "Supportive, collaborative work environment"
      ],
      "salary_min": 75000,
      "salary_max": 95000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 51,
      "company_name": "QuickServe Delivery",
      "company_description": "QuickServe is a local delivery service partnering with restaurants, retailers, and individuals for same-day delivery. We're a growing startup serving the metro area with fast, reliable service.",
      "position_title": "Delivery Driver",
      "job_type": "Part Time/Contractor",
      "location": "On-site in Nashville, TN",
      "position_summary": "QuickServe is hiring Delivery Drivers to pick up and deliver orders to customers. Work on your own schedule using your own vehicle. Great opportunity for flexible income with tips and bonuses.",
      "primary_responsibilities": [
        "Accept delivery assignments through mobile app",
        "Pick up orders from restaurants, stores, or customers",
        "Deliver items safely and promptly to customers",
        "Verify orders and ensure accuracy",
        "Provide friendly, professional customer service",
        "Communicate with customers regarding delivery status",
        "Follow traffic laws and safe driving practices",
        "Maintain cleanliness of vehicle",
        "Handle cash transactions when applicable",
        "Report any issues or concerns promptly"
      ],
      "requirements": [
        "Must be at least 19 years old",
        "Valid driver's license and clean driving record",
        "Reliable vehicle with insurance",
        "Smartphone with data plan",
        "Ability to lift and carry up to 40 lbs",
        "Good navigation and time management skills",
        "Professional appearance and demeanor",
        "Background check required",
        "Availability to work peak times (evenings/weekends) preferred"
      ],
      "benefits": [
        "Flexible schedule - work when you want",
        "Keep 100% of tips",
        "Weekly pay via direct deposit",
        "Bonus opportunities for high performance",
        "Mileage reimbursement",
        "Referral bonuses"
      ],
      "salary_min": 15.00,
      "salary_max": 25.00,
      "pay_period": "Hourly (including tips and bonuses, varies by hours and demand)",
      "relocation_required": null
    },
    {
      "id": 52,
      "company_name": "Titan Manufacturing",
      "company_description": "Titan Manufacturing is a heavy equipment manufacturer producing industrial machinery for construction, mining, and agriculture. Our 500,000 sq ft facility employs 400+ skilled workers and ships products worldwide.",
      "position_title": "Welding Engineer",
      "job_type": "Full Time",
      "location": "On-site in Milwaukee, WI",
      "position_summary": "Titan seeks a Welding Engineer to develop welding procedures, qualify welders, and provide technical support for manufacturing operations. You'll ensure weld quality and efficiency while supporting new product development.",
      "primary_responsibilities": [
        "Develop and qualify welding procedures (WPS/PQR) per AWS and ASME codes",
        "Design welding fixtures and tooling to improve efficiency and quality",
        "Provide technical support to production welding operations",
        "Investigate and resolve welding defects and quality issues",
        "Select appropriate welding processes, filler metals, and parameters",
        "Conduct welder performance qualifications and certifications",
        "Perform weld inspections using visual and NDT methods",
        "Support new product development with welding design input",
        "Implement welding process improvements and cost reductions",
        "Train welders and supervisors on new procedures and techniques",
        "Maintain welding documentation and quality records",
        "Collaborate with quality, engineering, and production teams"
      ],
      "requirements": [
        "Bachelor's degree in Welding Engineering, Materials Science, or related field",
        "5+ years of welding engineering experience in manufacturing",
        "Certified Welding Inspector (CWI) certification required",
        "Strong knowledge of GMAW, FCAW, SMAW, and GTAW processes",
        "Experience with AWS D1.1, ASME Section IX, and other welding codes",
        "Proficiency with welding symbols and blueprint reading",
        "Understanding of metallurgy and weld joint design",
        "Experience with robotic welding a plus",
        "Excellent problem-solving and analytical skills",
        "Strong communication and technical writing abilities",
        "CAD experience helpful"
      ],
      "benefits": [
        "Competitive salary",
        "Annual performance bonuses",
        "Comprehensive health benefits",
        "401(k) with generous company match",
        "Pension plan",
        "3 weeks PTO plus paid holidays",
        "Tuition reimbursement",
        "Professional development and certification support",
        "On-site fitness center",
        "Stable, growing company"
      ],
      "salary_min": 85000,
      "salary_max": 110000,
      "pay_period": "Annual",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 53,
      "company_name": "Bright Horizons Behavioral Health",
      "company_description": "Bright Horizons is a community mental health center providing counseling, psychiatric services, and case management to individuals and families. We serve a diverse population with compassionate, trauma-informed care.",
      "position_title": "Licensed Clinical Social Worker (LCSW)",
      "job_type": "Full Time",
      "location": "Hybrid in Albuquerque, NM (3 days in office)",
      "position_summary": "Bright Horizons is seeking an LCSW to provide individual and family therapy to adults and adolescents. You'll work with clients facing depression, anxiety, trauma, and life transitions in an outpatient setting.",
      "primary_responsibilities": [
        "Provide individual, family, and group therapy using evidence-based approaches",
        "Conduct comprehensive biopsychosocial assessments",
        "Develop treatment plans in collaboration with clients",
        "Maintain clinical documentation and progress notes in EHR system",
        "Coordinate care with psychiatrists, case managers, and community providers",
        "Conduct crisis assessments and safety planning",
        "Provide culturally competent, trauma-informed care",
        "Participate in case consultation and clinical supervision",
        "Maintain caseload of approximately 20-25 clients weekly",
        "Complete required training and continuing education",
        "Participate in community outreach and education"
      ],
      "requirements": [
        "Master's degree in Social Work (MSW) from CSWE-accredited program",
        "Current New Mexico LCSW license",
        "Experience with evidence-based therapies (CBT, DBT, trauma-focused therapy)",
        "Knowledge of DSM-5 and diagnostic assessment",
        "Experience working with diverse, underserved populations",
        "Strong crisis intervention skills",
        "Bilingual (English/Spanish) strongly preferred",
        "Excellent clinical documentation skills",
        "Compassionate, non-judgmental approach",
        "Ability to work with complex cases and multi-stressed families"
      ],
      "benefits": [
        "Competitive salary for community mental health",
        "Comprehensive health and dental insurance",
        "403(b) retirement plan",
        "Loan forgiveness eligible employer (NHSC, PSLF)",
        "Generous PTO and paid holidays",
        "Flexible hybrid schedule",
        "Clinical supervision and consultation provided",
        "Continuing education allowance",
        "Supportive, mission-driven work environment"
      ],
      "salary_min": 55000,
      "salary_max": 68000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 54,
      "company_name": "Pacific Marine Services",
      "company_description": "Pacific Marine provides marine construction, dock building, and vessel repair services along the West Coast. Our skilled crews work on commercial harbors, marinas, and waterfront infrastructure projects.",
      "position_title": "Marine Mechanic",
      "job_type": "Full Time",
      "location": "On-site in San Diego, CA",
      "position_summary": "Pacific Marine is hiring a Marine Mechanic to service and repair marine diesel engines, hydraulic systems, and vessel equipment. You'll work on commercial vessels, tugboats, and marine construction equipment.",
      "primary_responsibilities": [
        "Diagnose and repair marine diesel engines (Caterpillar, Cummins, Detroit)",
        "Perform preventive maintenance on vessels and equipment",
        "Service hydraulic systems, pumps, and winches",
        "Troubleshoot electrical systems and components",
        "Conduct engine overhauls and major repairs",
        "Test repaired systems and equipment for proper operation",
        "Maintain accurate service records and work orders",
        "Order parts and maintain inventory",
        "Work on vessels at dock and occasionally underway",
        "Follow all safety protocols and maritime regulations",
        "Respond to emergency repairs as needed"
      ],
      "requirements": [
        "High school diploma or equivalent; technical training preferred",
        "5+ years of marine diesel mechanic experience",
        "Strong knowledge of marine engines, transmissions, and propulsion systems",
        "Experience with hydraulic and electrical systems",
        "Ability to read schematics and technical manuals",
        "Proficiency with diagnostic tools and equipment",
        "Valid driver's license; TWIC card preferred",
        "Physical ability to work in confined spaces and lift heavy components",
        "Ability to work on water and in various weather conditions",
        "Strong problem-solving skills",
        "Own basic hand tools"
      ],
      "benefits": [
        "Competitive hourly wage with overtime opportunities",
        "Health, dental, and vision insurance",
        "401(k) plan",
        "Paid time off and holidays",
        "Company-provided specialty tools and equipment",
        "Ongoing training opportunities",
        "Per diem for travel jobs",
        "Union representation",
        "Job security in essential maritime industry"
      ],
      "salary_min": 32.00,
      "salary_max": 42.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 55,
      "company_name": "Horizon Media Group",
      "company_description": "Horizon Media Group owns and operates 15 radio stations across three markets, ranging from Top 40 to talk radio formats. We reach over 2 million listeners weekly and offer comprehensive advertising solutions.",
      "position_title": "Radio Account Executive",
      "job_type": "Full Time",
      "location": "On-site in Phoenix, AZ",
      "position_summary": "Horizon Media is seeking a motivated Account Executive to sell advertising solutions across our station cluster. You'll develop new business, manage client relationships, and help businesses grow through strategic radio campaigns.",
      "primary_responsibilities": [
        "Prospect for new advertising clients through cold calling, networking, and referrals",
        "Develop customized advertising proposals and media plans",
        "Present radio advertising solutions to business owners and marketing managers",
        "Negotiate rates and close sales to meet monthly revenue goals",
        "Manage existing client accounts and identify upsell opportunities",
        "Collaborate with creative team on commercial production",
        "Track campaign performance and provide client reports",
        "Attend community events and build market presence",
        "Stay informed on local business landscape and competitive media",
        "Maintain accurate records in CRM system",
        "Participate in sales meetings and training"
      ],
      "requirements": [
        "Bachelor's degree preferred",
        "2+ years of media sales or B2B sales experience",
        "Proven track record of meeting/exceeding sales quotas",
        "Strong presentation and negotiation skills",
        "Self-motivated with entrepreneurial drive",
        "Excellent communication and relationship-building abilities",
        "Understanding of marketing principles and ROI",
        "Proficiency with CRM systems and Microsoft Office",
        "Valid driver's license and reliable transportation",
        "Radio or advertising experience a plus",
        "Passion for sales and helping businesses succeed"
      ],
      "benefits": [
        "Base salary plus uncapped commission",
        "Monthly bonuses for exceeding goals",
        "Health and dental insurance",
        "401(k) plan",
        "Paid vacation and holidays",
        "Company vehicle or car allowance for top performers",
        "Sales training and development programs",
        "Station event tickets and promotional perks",
        "Fun, energetic work environment"
      ],
      "salary_min": 40000,
      "salary_max": 85000,
      "pay_period": "Annual (base + commission, top performers earn $75K-$100K+)",
      "relocation_required": null
    },
    {
      "id": 56,
      "company_name": "Stellar Biotech",
      "company_description": "Stellar Biotech is a contract research organization (CRO) providing preclinical research services to pharmaceutical and biotech companies. Our GLP-compliant labs conduct toxicology, pharmacokinetics, and efficacy studies.",
      "position_title": "Research Scientist - Toxicology",
      "job_type": "Full Time",
      "location": "On-site in Research Triangle Park, NC",
      "position_summary": "Stellar Biotech seeks a Research Scientist to design and conduct in vivo toxicology studies supporting IND submissions. You'll work with a collaborative team conducting GLP studies for novel therapeutics.",
      "primary_responsibilities": [
        "Design and execute in vivo toxicology studies in rodent and non-rodent species",
        "Serve as study director for GLP-compliant studies",
        "Develop study protocols and reports following ICH and FDA guidelines",
        "Supervise technical staff and oversee daily study conduct",
        "Perform dose administration, clinical observations, and sample collection",
        "Analyze and interpret toxicology data",
        "Prepare technical reports for regulatory submissions",
        "Interact with clients to discuss study design and results",
        "Ensure compliance with GLP regulations and animal welfare standards",
        "Present findings at internal and client meetings",
        "Contribute to business development and proposal preparation",
        "Mentor junior scientists"
      ],
      "requirements": [
        "PhD in Toxicology, Pharmacology, or related field; MS with 5+ years experience considered",
        "3+ years of in vivo toxicology experience in CRO or pharmaceutical setting",
        "Strong knowledge of GLP regulations and regulatory toxicology",
        "Experience as study director or aspiring to that role",
        "Proficiency with toxicology endpoints and pathology review",
        "Excellent scientific writing and presentation skills",
        "Strong project management and organizational abilities",
        "Experience with ICH guidelines (M3, S6, etc.)",
        "DABT certification preferred",
        "Hands-on animal handling experience required"
      ],
      "benefits": [
        "Competitive salary with annual increases",
        "Performance bonuses",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with 6% match",
        "4 weeks PTO plus paid holidays",
        "Continuing education support and conference attendance",
        "Relocation assistance",
        "Modern GLP-compliant facilities",
        "Collaborative scientific environment",
        "Career growth opportunities"
      ],
      "salary_min": 95000,
      "salary_max": 125000,
      "pay_period": "Annual",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 57,
      "company_name": "Heritage Furniture Makers",
      "company_description": "Heritage Furniture is a custom furniture workshop creating handcrafted tables, cabinets, and built-ins from sustainably sourced hardwoods. Our pieces combine traditional craftsmanship with contemporary design.",
      "position_title": "Furniture Maker / Woodworker",
      "job_type": "Full Time",
      "location": "On-site in Asheville, NC",
      "position_summary": "Heritage Furniture seeks a skilled Furniture Maker to craft custom wood furniture from design through finishing. You'll work with premium hardwoods using both traditional hand tools and modern machinery.",
      "primary_responsibilities": [
        "Build custom furniture pieces from shop drawings and specifications",
        "Select and mill lumber for projects",
        "Operate woodworking machinery including table saws, jointers, planers, and shapers",
        "Create joinery using mortise-and-tenon, dovetails, and other techniques",
        "Sand and prepare surfaces for finishing",
        "Apply stains, finishes, and protective coatings",
        "Install hardware and fittings",
        "Deliver and install furniture at client locations",
        "Maintain tools and equipment in good working condition",
        "Follow safety protocols and maintain clean workshop",
        "Collaborate with designers on custom projects",
        "Estimate materials and time for projects"
      ],
      "requirements": [
        "3-5 years of professional woodworking/furniture making experience",
        "Proficiency with woodworking machinery and hand tools",
        "Strong joinery skills and understanding of wood movement",
        "Ability to read and work from technical drawings",
        "Knowledge of wood species, characteristics, and finishing techniques",
        "Attention to detail and commitment to quality craftsmanship",
        "Physical ability to lift heavy materials and stand for extended periods",
        "Problem-solving skills and creative thinking",
        "Valid driver's license for deliveries",
        "Portfolio of work samples required",
        "Formal woodworking training a plus"
      ],
      "benefits": [
        "Competitive hourly wage based on skill level",
        "Health insurance after 90 days",
        "Paid time off",
        "Access to quality tools and materials",
        "Opportunity to work on diverse custom projects",
        "Collaborative, craft-focused environment",
        "Beautiful mountain location"
      ],
      "salary_min": 22.00,
      "salary_max": 32.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 58,
      "company_name": "Vertex Management Consulting",
      "company_description": "Vertex is a strategy and operations consulting firm serving Fortune 500 clients across industries. Our 500+ consultants deliver transformational results in areas including digital transformation, M&A, and operational excellence.",
      "position_title": "Management Consultant",
      "job_type": "Full Time",
      "location": "Hybrid in Chicago, IL (extensive client site travel required)",
      "position_summary": "Vertex seeks high-performing Management Consultants to work on strategic projects for top-tier clients. You'll analyze complex business problems, develop recommendations, and drive implementation of solutions.",
      "primary_responsibilities": [
        "Lead workstreams on client engagements across strategy and operations",
        "Conduct quantitative and qualitative analysis to identify insights",
        "Develop strategic recommendations and business cases",
        "Create executive-level presentations and deliverables",
        "Facilitate workshops and interviews with C-suite executives",
        "Manage project workplans, timelines, and deliverables",
        "Supervise and mentor analysts and associates",
        "Build strong client relationships and identify follow-on opportunities",
        "Support business development through proposal development",
        "Contribute to internal knowledge management and thought leadership",
        "Travel Monday-Thursday to client sites (80%)"
      ],
      "requirements": [
        "MBA from top-tier business school or equivalent advanced degree",
        "3-5 years of management consulting or relevant industry experience",
        "Strong analytical and problem-solving capabilities",
        "Excellent PowerPoint and Excel skills",
        "Outstanding written and verbal communication abilities",
        "Ability to structure ambiguous problems and drive to solutions",
        "Experience managing teams and client relationships",
        "Intellectual curiosity and quick learning ability",
        "Willingness to travel extensively (80%+)",
        "Previous consulting experience at MBB or top-tier firm preferred"
      ],
      "benefits": [
        "Base salary $140K-$180K plus performance bonuses",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with company match",
        "Generous PTO policy",
        "Travel rewards points and status",
        "Annual education/certification allowance",
        "Gym membership reimbursement",
        "Clear path to partnership",
        "Intellectually challenging work with top-tier clients"
      ],
      "salary_min": 140000,
      "salary_max": 180000,
      "pay_period": "Annual (plus bonus typically 20-30% of base)",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 59,
      "company_name": "City Parks & Recreation Department",
      "company_description": "The City Parks & Recreation Department maintains 75 parks, community centers, and recreational facilities serving residents through sports leagues, programs, and events. We're committed to enhancing quality of life through recreation.",
      "position_title": "Recreation Coordinator",
      "job_type": "Full Time",
      "location": "On-site in Fort Collins, CO",
      "position_summary": "The City is seeking a Recreation Coordinator to plan and implement recreational programs including youth sports, fitness classes, and community events. You'll work with diverse populations creating inclusive programming.",
      "primary_responsibilities": [
        "Plan, organize, and implement recreational programs and special events",
        "Recruit, hire, train, and supervise part-time program staff and volunteers",
        "Market programs through social media, website, and promotional materials",
        "Manage program budgets and track revenues/expenses",
        "Register participants and collect fees using recreation software",
        "Ensure safe program delivery and risk management",
        "Evaluate program effectiveness and participant satisfaction",
        "Coordinate facility scheduling and equipment needs",
        "Build partnerships with community organizations and schools",
        "Respond to participant inquiries and resolve concerns",
        "Maintain program records and prepare reports",
        "Work flexible hours including evenings and weekends for programs"
      ],
      "requirements": [
        "Bachelor's degree in Recreation, Sports Management, or related field",
        "2-3 years of recreation programming experience",
        "Knowledge of program planning, marketing, and evaluation",
        "Experience supervising staff and volunteers",
        "Strong organizational and project management skills",
        "Excellent interpersonal and communication abilities",
        "Commitment to diversity, equity, and inclusion",
        "Proficiency with Microsoft Office and recreation software",
        "CPR and First Aid certification (or willingness to obtain)",
        "Valid driver's license",
        "Background check required"
      ],
      "benefits": [
        "Competitive public sector salary",
        "Comprehensive health benefits with low employee cost",
        "Retirement plan (PERA) with employer contribution",
        "3 weeks vacation plus sick leave",
        "11 paid holidays",
        "Free recreation program participation",
        "Professional development opportunities",
        "Work-life balance",
        "Meaningful public service work"
      ],
      "salary_min": 48000,
      "salary_max": 58000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 60,
      "company_name": "TechSafe Cybersecurity",
      "company_description": "TechSafe provides managed cybersecurity services to small and medium-sized businesses, including 24/7 monitoring, incident response, vulnerability management, and security awareness training. We protect 500+ clients nationwide.",
      "position_title": "Security Operations Center (SOC) Analyst",
      "job_type": "Full Time",
      "location": "Remote (US only)",
      "position_summary": "TechSafe is hiring SOC Analysts to monitor security events, investigate alerts, and respond to incidents for our clients. You'll work in our 24/7 SOC identifying and mitigating threats in real-time.",
      "primary_responsibilities": [
        "Monitor security alerts from SIEM, EDR, and other security tools",
        "Triage and investigate security events to determine severity and impact",
        "Perform initial incident response and containment actions",
        "Document security incidents and escalate to senior analysts when appropriate",
        "Conduct malware analysis and threat hunting activities",
        "Perform log analysis to identify suspicious activity",
        "Create and tune detection rules to improve alert accuracy",
        "Communicate with clients regarding security events and incidents",
        "Maintain SOC playbooks and procedures",
        "Participate in continuous improvement of SOC operations",
        "Work rotating shifts including nights and weekends"
      ],
      "requirements": [
        "Bachelor's degree in Cybersecurity, Computer Science, or related field (or equivalent experience)",
        "1-3 years of security monitoring or SOC analyst experience",
        "Knowledge of common attack vectors, malware, and threat actor tactics",
        "Familiarity with SIEM platforms (Splunk, Sentinel, etc.) and security tools",
        "Understanding of network protocols, Windows/Linux systems, and log analysis",
        "Strong analytical and problem-solving skills",
        "Excellent written communication for incident documentation",
        "Ability to work independently in remote environment",
        "Security+ or CySA+ certification preferred",
        "Willingness to work shifts including nights/weekends"
      ],
      "benefits": [
        "Competitive salary with shift differentials",
        "100% remote work",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with 4% match",
        "Generous PTO policy",
        "Certification training and exam reimbursement",
        "Home office equipment provided",
        "Career advancement opportunities",
        "Work with diverse clients and technologies"
      ],
      "salary_min": 65000,
      "salary_max": 80000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 61,
      "company_name": "Cornerstone Home Builders",
      "company_description": "Cornerstone is a custom home builder specializing in luxury residences throughout suburban markets. With 40 years in business and over 1,000 homes built, we're known for quality craftsmanship and customer satisfaction.",
      "position_title": "Construction Superintendent",
      "job_type": "Full Time",
      "location": "On-site in Raleigh-Durham, NC",
      "position_summary": "Cornerstone seeks an experienced Construction Superintendent to oversee custom home construction from foundation to final walkthrough. You'll manage schedules, coordinate trades, and ensure quality standards are met.",
      "primary_responsibilities": [
        "Oversee daily job site operations for 3-5 custom homes simultaneously",
        "Coordinate and schedule subcontractors and suppliers",
        "Conduct daily site inspections for quality, safety, and code compliance",
        "Review plans and identify potential construction issues proactively",
        "Manage construction timeline and communicate schedule to stakeholders",
        "Conduct weekly meetings with homeowners to provide updates",
        "Ensure compliance with building codes and obtain necessary inspections",
        "Review and approve subcontractor invoices and change orders",
        "Resolve construction issues and coordinate solutions",
        "Maintain organized job sites and enforce safety protocols",
        "Conduct pre-drywall and final walkthroughs with clients",
        "Complete punch lists and ensure quality deliverables"
      ],
      "requirements": [
        "10+ years of residential construction experience with 5+ years as superintendent",
        "Proven track record managing custom home projects ($500K-$2M+)",
        "Strong knowledge of residential construction methods and building codes",
        "Excellent communication and customer service skills",
        "Ability to read and interpret blueprints and specifications",
        "Strong organizational and time management abilities",
        "Proficiency with construction management software (Buildertrend, CoConstruct)",
        "Valid driver's license and reliable transportation",
        "Ability to climb ladders and walk job sites throughout the day",
        "OSHA 30 certification preferred"
      ],
      "benefits": [
        "Competitive salary with performance bonuses",
        "Company truck and fuel card",
        "Cell phone and tablet provided",
        "Comprehensive health benefits",
        "401(k) with company match",
        "3 weeks PTO plus paid holidays",
        "Professional development opportunities",
        "Stable company with consistent pipeline of projects"
      ],
      "salary_min": 85000,
      "salary_max": 110000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 62,
      "company_name": "GreenLeaf Landscaping & Design",
      "company_description": "GreenLeaf is an award-winning landscape design-build firm creating sustainable outdoor spaces for residential and commercial clients. Our 30-person team specializes in native plantings, outdoor living spaces, and water features.",
      "position_title": "Landscape Designer",
      "job_type": "Full Time",
      "location": "Hybrid in San Francisco Bay Area, CA (2 days remote)",
      "position_summary": "GreenLeaf seeks a creative Landscape Designer to conceptualize and design sustainable landscapes from initial consultation through construction documentation. You'll work with clients creating beautiful, ecologically responsible outdoor spaces.",
      "primary_responsibilities": [
        "Meet with clients to understand their vision, needs, and budget",
        "Conduct site analysis including measurements, photos, and existing conditions",
        "Develop conceptual design options with sketches and mood boards",
        "Create detailed planting plans, hardscape layouts, and irrigation designs",
        "Produce construction documents, specifications, and details",
        "Select appropriate plants considering climate, site conditions, and maintenance",
        "Specify materials for patios, walkways, retaining walls, and structures",
        "Prepare cost estimates and collaborate with estimating team",
        "Present designs to clients and incorporate feedback",
        "Coordinate with project managers and installation crews",
        "Conduct site visits during construction to ensure design intent",
        "Stay current on sustainable landscape practices and native plants"
      ],
      "requirements": [
        "Bachelor's degree in Landscape Architecture or related field",
        "3-5 years of residential landscape design experience",
        "Proficiency with AutoCAD, SketchUp, and Adobe Creative Suite",
        "Strong knowledge of plants, particularly California natives and drought-tolerant species",
        "Understanding of grading, drainage, and irrigation design",
        "Excellent hand sketching and visualization skills",
        "Strong client communication and presentation abilities",
        "Knowledge of sustainable landscape practices and SITES principles",
        "Valid driver's license for site visits",
        "APLD or ASLA membership preferred"
      ],
      "benefits": [
        "Competitive salary based on experience",
        "Health and dental insurance",
        "401(k) with company match",
        "Flexible hybrid schedule",
        "PTO and paid holidays",
        "Professional development budget",
        "Membership dues paid",
        "Creative, collaborative work environment",
        "Opportunity to work on award-winning projects"
      ],
      "salary_min": 65000,
      "salary_max": 85000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 63,
      "company_name": "Valley Medical Imaging",
      "company_description": "Valley Medical Imaging operates five outpatient imaging centers providing MRI, CT, ultrasound, and X-ray services. We're committed to accurate diagnoses delivered with compassionate patient care and fast turnaround times.",
      "position_title": "Radiologic Technologist",
      "job_type": "Full Time",
      "location": "On-site in Fresno, CA",
      "position_summary": "Valley Medical Imaging seeks a registered Radiologic Technologist to perform diagnostic imaging procedures. You'll work with state-of-the-art equipment in a patient-focused environment producing high-quality images.",
      "primary_responsibilities": [
        "Perform diagnostic X-ray examinations following physician orders",
        "Position patients correctly and select appropriate technical factors",
        "Ensure image quality meets diagnostic standards",
        "Maintain radiation safety standards (ALARA principles)",
        "Explain procedures to patients and address concerns",
        "Maintain patient records and documentation in PACS/RIS systems",
        "Perform quality control checks on imaging equipment",
        "Assist radiologists with special procedures as needed",
        "Maintain clean and organized imaging rooms",
        "Follow infection control and safety protocols",
        "Cross-train on CT or other modalities as requested"
      ],
      "requirements": [
        "Graduate of JRCERT-accredited radiography program",
        "Current ARRT (R) certification required",
        "California state radiologic technology license (CRT)",
        "BLS certification",
        "1-2 years of clinical experience preferred",
        "Strong technical skills and attention to image quality",
        "Excellent patient care and communication abilities",
        "Ability to lift and position patients safely",
        "Flexibility to work varied shifts including some weekends",
        "CT or MRI cross-training a plus"
      ],
      "benefits": [
        "Competitive hourly rate with shift differentials",
        "Comprehensive health benefits",
        "401(k) with company match",
        "Paid time off and holidays",
        "Continuing education support and paid CE days",
        "Licensure and certification renewal fees paid",
        "Stable work environment with modern equipment",
        "Opportunities for modality cross-training"
      ],
      "salary_min": 32.00,
      "salary_max": 42.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 64,
      "company_name": "Momentum Digital Agency",
      "company_description": "Momentum is a performance-driven digital marketing agency specializing in paid search, SEO, and social media advertising. Our 25-person team manages over $10M in annual ad spend for e-commerce and lead generation clients.",
      "position_title": "PPC Specialist",
      "job_type": "Full Time",
      "location": "Remote (US only)",
      "position_summary": "Momentum seeks a data-driven PPC Specialist to manage and optimize paid search campaigns for our clients. You'll develop strategies, analyze performance, and drive ROI through Google Ads, Microsoft Ads, and shopping campaigns.",
      "primary_responsibilities": [
        "Manage day-to-day paid search campaigns (Google Ads, Microsoft Ads)",
        "Develop campaign strategies aligned with client goals and KPIs",
        "Conduct keyword research and competitive analysis",
        "Write compelling ad copy and develop ad variations for testing",
        "Optimize campaigns through bid management, ad testing, and audience targeting",
        "Analyze campaign performance data and identify improvement opportunities",
        "Prepare client reports with insights and recommendations",
        "Monitor budgets and pacing to hit monthly targets",
        "Stay current on platform updates and industry best practices",
        "Communicate campaign performance and strategies to clients",
        "Collaborate with SEO and social teams on integrated strategies",
        "Manage Google Shopping and Performance Max campaigns"
      ],
      "requirements": [
        "Bachelor's degree in Marketing, Business, or related field",
        "2-4 years of hands-on PPC management experience",
        "Google Ads certification required",
        "Proven track record managing campaigns with $20K+ monthly budgets",
        "Strong analytical skills and proficiency with Excel/Google Sheets",
        "Experience with Google Analytics and conversion tracking",
        "Knowledge of e-commerce and lead generation best practices",
        "Excellent attention to detail and organizational skills",
        "Strong written and verbal communication abilities",
        "Ability to manage multiple client accounts simultaneously",
        "Experience with bid management platforms a plus"
      ],
      "benefits": [
        "Competitive salary",
        "100% remote work with flexible hours",
        "Health and dental insurance",
        "401(k) plan",
        "Unlimited PTO policy",
        "Annual professional development budget",
        "Home office stipend",
        "Latest technology and software",
        "Collaborative team culture with regular virtual hangouts"
      ],
      "salary_min": 60000,
      "salary_max": 75000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 65,
      "company_name": "Mountain View Senior Living",
      "company_description": "Mountain View is a continuing care retirement community offering independent living, assisted living, and skilled nursing on a beautiful campus. We provide person-centered care and vibrant programming for 250 residents.",
      "position_title": "Activities Director",
      "job_type": "Full Time",
      "location": "On-site in Spokane, WA",
      "position_summary": "Mountain View seeks an energetic Activities Director to plan and implement engaging programs for residents across all levels of care. You'll create meaningful activities that promote physical, mental, and social well-being.",
      "primary_responsibilities": [
        "Develop and implement comprehensive activity calendar for all resident groups",
        "Plan diverse programs including exercise classes, arts/crafts, games, music, and outings",
        "Coordinate special events, entertainment, and holiday celebrations",
        "Assess residents' interests and involve them in activity planning",
        "Recruit, train, and supervise activity staff and volunteers",
        "Transport residents to off-site activities and appointments",
        "Maintain activity attendance records and documentation",
        "Manage activity budget and order supplies",
        "Ensure activities meet state regulatory requirements",
        "Collaborate with other departments on resident care plans",
        "Build relationships with community organizations for partnerships",
        "Adapt programs for residents with cognitive impairments"
      ],
      "requirements": [
        "Bachelor's degree in Recreation Therapy, Gerontology, or related field preferred",
        "2-3 years of activity planning experience in senior living",
        "Activity Director certification or willingness to obtain",
        "Knowledge of person-centered care and dementia programming",
        "Creative programming skills across diverse interests and abilities",
        "Strong leadership and volunteer management abilities",
        "Excellent interpersonal and communication skills",
        "Patience, empathy, and genuine enjoyment working with seniors",
        "Proficiency with Microsoft Office and scheduling software",
        "Valid driver's license with clean record",
        "Flexibility to work some evenings and weekends for events"
      ],
      "benefits": [
        "Competitive salary",
        "Health, dental, and vision insurance",
        "403(b) retirement plan",
        "Generous PTO",
        "Paid holidays",
        "Free meals during shifts",
        "Continuing education support",
        "Rewarding work making a difference in seniors' lives"
      ],
      "salary_min": 48000,
      "salary_max": 58000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 66,
      "company_name": "Apex Structural Engineers",
      "company_description": "Apex is a structural engineering firm providing design services for commercial, institutional, and residential projects. Our 15-engineer team works on diverse projects from office buildings to stadium renovations.",
      "position_title": "Structural Engineer",
      "job_type": "Full Time",
      "location": "Hybrid in Denver, CO (2 days in office)",
      "position_summary": "Apex seeks a licensed Structural Engineer to design structural systems for building projects. You'll perform calculations, create construction documents, and coordinate with architects and contractors.",
      "primary_responsibilities": [
        "Design structural systems for new construction and renovation projects",
        "Perform structural calculations and analysis using RISA, SAP2000, or similar software",
        "Prepare structural drawings and specifications",
        "Conduct site visits for existing condition assessments",
        "Review shop drawings and respond to RFIs during construction",
        "Coordinate with architects, MEP engineers, and contractors",
        "Ensure designs comply with building codes and standards",
        "Perform peer reviews of other engineers' work",
        "Mentor EIT staff and provide technical guidance",
        "Assist with project proposals and fee estimates",
        "Maintain project schedules and budgets",
        "Stay current on building codes and industry developments"
      ],
      "requirements": [
        "Bachelor's degree in Civil/Structural Engineering required; Master's preferred",
        "Professional Engineer (PE) license in Colorado required",
        "4-8 years of structural design experience",
        "Proficiency with structural analysis software (RISA, SAP2000, RAM)",
        "Strong knowledge of steel, concrete, wood, and masonry design",
        "Experience with building codes (IBC, ASCE 7, ACI, AISC)",
        "Excellent calculation and technical writing skills",
        "Strong problem-solving and critical thinking abilities",
        "Effective communication with clients and project teams",
        "AutoCAD and/or Revit experience required",
        "Seismic design experience a plus"
      ],
      "benefits": [
        "Competitive salary based on experience",
        "Performance bonuses",
        "Comprehensive health benefits",
        "401(k) with match",
        "Flexible hybrid schedule",
        "Generous PTO",
        "Professional development support",
        "Licensure and membership dues paid",
        "Collaborative work environment",
        "Interesting variety of projects"
      ],
      "salary_min": 60000,
      "salary_max": 75000,
      "pay_period": "Annual",
      "relocation_required": null
    },
        {
      "id": 67,
      "company_name": "Midwest Distribution Center",
      "company_description": "Midwest Distribution is a third-party logistics provider operating a 500,000 sq ft warehouse facility. We provide warehousing, order fulfillment, and value-added services for e-commerce and retail clients.",
      "position_title": "Forklift Operator",
      "job_type": "Full Time",
      "location": "On-site in Columbus, OH",
      "position_summary": "Midwest Distribution is hiring certified Forklift Operators for warehouse operations. You'll operate sit-down and stand-up forklifts to move inventory, load trucks, and support efficient warehouse flow.",
      "primary_responsibilities": [
        "Operate forklifts safely to move pallets and materials throughout warehouse",
        "Load and unload trucks using forklifts and pallet jacks",
        "Put away incoming inventory to proper locations",
        "Pick orders and stage for shipping",
        "Perform cycle counts and inventory checks",
        "Inspect forklift before each shift and report issues",
        "Maintain clean and organized work area",
        "Follow all safety procedures and wear required PPE",
        "Scan inventory using RF scanner",
        "Meet productivity standards while maintaining accuracy",
        "Assist with other warehouse tasks as needed"
      ],
      "requirements": [
        "High school diploma or equivalent",
        "Valid forklift certification required",
        "1+ years of forklift operating experience in warehouse setting",
        "Ability to operate sit-down, stand-up, and reach forklifts",
        "Basic math and computer skills",
        "Attention to detail and safety-conscious mindset",
        "Ability to work in fast-paced environment",
        "Physical ability to lift 50 lbs occasionally",
        "Reliable attendance and punctuality",
        "Willingness to work overtime and weekends during peak season",
        "Steel-toe boots required"
      ],
      "benefits": [
        "Starting pay $18-$20/hour based on experience",
        "Shift differential for 2nd and 3rd shifts",
        "Overtime opportunities",
        "Health insurance after 60 days",
        "401(k) plan",
        "Weekly pay",
        "Paid time off",
        "Climate-controlled facility",
        "Safety incentive programs",
        "Advancement opportunities"
      ],
      "salary_min": 18.00,
      "salary_max": 20.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 68,
      "company_name": "Stellar Software Solutions",
      "company_description": "Stellar Software is a SaaS company providing project management and collaboration tools for creative agencies and marketing teams. Our platform serves 50,000+ users globally and we're experiencing rapid growth.",
      "position_title": "Customer Success Manager",
      "job_type": "Full Time",
      "location": "Remote (US only)",
      "position_summary": "Stellar Software seeks a Customer Success Manager to build relationships with clients, drive product adoption, and ensure customer satisfaction. You'll serve as a trusted advisor helping clients maximize value from our platform.",
      "primary_responsibilities": [
        "Manage portfolio of 40-50 customer accounts",
        "Build strong relationships with key stakeholders and decision-makers",
        "Conduct onboarding and training sessions for new customers",
        "Monitor customer health metrics and proactively address concerns",
        "Identify expansion opportunities and coordinate with sales team",
        "Analyze usage data to provide recommendations for optimization",
        "Conduct quarterly business reviews with customers",
        "Advocate for customer needs with product and engineering teams",
        "Develop and share best practices and success stories",
        "Track and report on key success metrics (retention, NPS, expansion)",
        "Coordinate with support team to resolve technical issues",
        "Achieve renewal and expansion revenue targets"
      ],
      "requirements": [
        "Bachelor's degree required",
        "3-5 years of customer success or account management experience in SaaS",
        "Proven track record of managing customer relationships and driving retention",
        "Strong understanding of SaaS metrics and customer lifecycle",
        "Excellent communication and presentation skills",
        "Ability to understand technical products and explain value to non-technical users",
        "Experience with project management or marketing technology a plus",
        "Proficiency with CRM systems (Salesforce) and CS platforms (Gainsight)",
        "Analytical mindset with data-driven approach",
        "Self-motivated and able to work independently remotely",
        "Passion for customer advocacy and problem-solving"
      ],
      "benefits": [
        "Competitive base salary plus variable compensation",
        "100% remote work",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with 4% match",
        "Unlimited PTO policy",
        "Home office stipend",
        "Professional development budget",
        "Equity options",
        "Latest technology and software",
        "Collaborative, growth-oriented culture"
      ],
      "salary_min": 75000,
      "salary_max": 95000,
      "pay_period": "Annual (plus variable comp based on renewals/expansion)",
      "relocation_required": null
    },
    {
      "id": 69,
      "company_name": "Riverside Credit Union",
      "company_description": "Riverside Credit Union is a member-owned financial institution serving 100,000 members with 20 branches and $1.5B in assets. We provide personal banking, mortgages, business services, and investment products.",
      "position_title": "Branch Manager",
      "job_type": "Full Time",
      "location": "On-site in Eugene, OR",
      "position_summary": "Riverside Credit Union seeks an experienced Branch Manager to lead our main branch location. You'll oversee daily operations, lead a team of 12 staff, drive membership growth, and ensure exceptional member service.",
      "primary_responsibilities": [
        "Oversee all branch operations including teller, lending, and member service functions",
        "Lead, coach, and develop branch staff to achieve goals",
        "Drive membership growth through community engagement and business development",
        "Ensure excellent member service and resolve escalated issues",
        "Monitor branch performance against goals and implement action plans",
        "Conduct staff meetings, training, and performance reviews",
        "Ensure compliance with regulations and credit union policies",
        "Manage branch budget and control expenses",
        "Approve loans within authority limits",
        "Build relationships with local businesses and community organizations",
        "Oversee cash management and security procedures",
        "Represent credit union at community events and networking functions"
      ],
      "requirements": [
        "Bachelor's degree in Business or Finance preferred",
        "5+ years of progressive experience in financial services with 2+ years in management",
        "Strong knowledge of retail banking products, lending, and regulations",
        "Proven leadership and team development abilities",
        "Excellent sales and business development skills",
        "Outstanding member service orientation",
        "Strong analytical and problem-solving capabilities",
        "Proficiency with banking systems and Microsoft Office",
        "Active community involvement and networking skills",
        "Valid driver's license",
        "NMLS license or ability to obtain"
      ],
      "benefits": [
        "Competitive salary with performance incentives",
        "Comprehensive health, dental, and vision insurance",
        "Pension plan plus 401(k) with match",
        "4 weeks PTO plus paid holidays",
        "Life and disability insurance",
        "Employee loan discounts",
        "Professional development opportunities",
        "Supportive, member-focused culture"
      ],
      "salary_min": 70000,
      "salary_max": 85000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 70,
      "company_name": "Precision Machining & Manufacturing",
      "company_description": "Precision Machining is a contract manufacturer providing CNC machining, sheet metal fabrication, and assembly services. We serve aerospace, defense, and medical device industries with AS9100 and ISO 13485 certifications.",
      "position_title": "Quality Inspector",
      "job_type": "Full Time",
      "location": "On-site in Tucson, AZ",
      "position_summary": "Precision Machining seeks a Quality Inspector to perform first article, in-process, and final inspections on machined components. You'll use precision measuring equipment to ensure parts meet customer specifications and quality standards.",
      "primary_responsibilities": [
        "Perform dimensional inspections using CMM, optical comparators, and hand tools",
        "Verify parts against blueprints, specifications, and quality standards",
        "Complete first article inspection reports (FAIR)",
        "Conduct in-process inspections on manufacturing floor",
        "Document inspection results and maintain quality records",
        "Identify non-conforming materials and initiate corrective actions",
        "Calibrate and maintain inspection equipment",
        "Interpret GD&T and complex blueprint specifications",
        "Communicate quality issues to production and engineering",
        "Support customer audits and quality system requirements",
        "Participate in root cause analysis and corrective action activities",
        "Ensure compliance with AS9100 and ISO 13485 standards"
      ],
      "requirements": [
        "High school diploma or equivalent; technical training preferred",
        "3-5 years of quality inspection experience in precision manufacturing",
        "Proficiency with CMM programming and operation (PC-DMIS preferred)",
        "Strong working knowledge of GD&T (ASME Y14.5)",
        "Experience with precision measuring instruments (micrometers, calipers, indicators, etc.)",
        "Ability to read and interpret complex technical drawings",
        "Familiarity with AS9100 or ISO quality systems",
        "Attention to detail and strong documentation skills",
        "Basic computer skills for data entry and reporting",
        "ASQ CQI certification a plus"
      ],
      "benefits": [
        "Competitive hourly wage",
        "Comprehensive health benefits",
        "401(k) with company match",
        "Paid time off and holidays",
        "Climate-controlled inspection lab",
        "Ongoing training and certification support",
        "Stable aerospace/defense industry work",
        "Overtime opportunities"
      ],
      "salary_min": 22.00,
      "salary_max": 30.00,
      "pay_period": "Hourly",
      "relocation_required": null
    },
    {
      "id": 71,
      "company_name": "Harmony Music Academy",
      "company_description": "Harmony Music Academy is a community music school offering private lessons, group classes, and ensemble experiences for students of all ages. Our 20 instructors teach piano, guitar, strings, voice, and more.",
      "position_title": "Music Teacher - Piano",
      "job_type": "Part Time",
      "location": "On-site in Ann Arbor, MI",
      "position_summary": "Harmony Music Academy seeks an experienced Piano Teacher to provide private lessons to students ages 5 and up. You'll inspire students through personalized instruction while fostering their musical growth and love of music.",
      "primary_responsibilities": [
        "Teach weekly 30-minute or 60-minute private piano lessons",
        "Develop individualized lesson plans based on student goals and abilities",
        "Teach proper technique, music theory, and repertoire across styles",
        "Prepare students for recitals, exams, and competitions as appropriate",
        "Communicate with parents regarding student progress",
        "Maintain accurate attendance and lesson notes",
        "Participate in studio recitals (2-3 per year)",
        "Create positive, encouraging learning environment",
        "Adapt teaching methods to different learning styles and ages",
        "Stay current with pedagogical best practices"
      ],
      "requirements": [
        "Bachelor's degree in Music, Music Education, or Piano Performance",
        "3+ years of piano teaching experience",
        "Strong classical piano technique and proficiency",
        "Knowledge of diverse repertoire and teaching methods",
        "Excellent communication skills with students and parents",
        "Patience, enthusiasm, and passion for teaching",
        "Ability to teach beginners through advanced students",
        "Experience with music theory and sight-reading instruction",
        "Background check required",
        "Evening and weekend availability required"
      ],
      "benefits": [
        "Competitive hourly rate ($35-$50 per lesson hour)",
        "Flexible schedule",
        "Use of quality instruments and teaching spaces",
        "Supportive, collaborative teaching community",
        "Professional development opportunities",
        "Performance opportunities"
      ],
      "salary_min": 35.00,
      "salary_max": 50.00,
      "pay_period": "Per lesson hour",
      "relocation_required": null
    },
    {
      "id": 72,
      "company_name": "Quantum Materials Lab",
      "company_description": "Quantum Materials Lab is a research institute conducting cutting-edge research in quantum computing, superconductivity, and nanomaterials. We collaborate with universities and industry partners on groundbreaking science.",
      "position_title": "Postdoctoral Research Associate - Quantum Physics",
      "job_type": "Full Time - Fixed Term (2 years)",
      "location": "On-site in Cambridge, MA",
      "position_summary": "Quantum Materials Lab seeks a Postdoctoral Researcher to conduct experimental research in quantum materials and devices. You'll work on superconducting qubit development with access to state-of-the-art facilities.",
      "primary_responsibilities": [
        "Design and conduct experimental research on quantum materials and devices",
        "Fabricate and characterize superconducting quantum circuits",
        "Perform cryogenic measurements at millikelvin temperatures",
        "Analyze experimental data and develop theoretical models",
        "Prepare manuscripts for publication in peer-reviewed journals",
        "Present research findings at conferences and seminars",
        "Collaborate with graduate students and research scientists",
        "Contribute to grant proposals and funding applications",
        "Maintain laboratory equipment and cleanroom facilities",
        "Participate in research group meetings and discussions",
        "Mentor graduate and undergraduate students"
      ],
      "requirements": [
        "PhD in Physics, Applied Physics, or related field required (completed within last 3 years)",
        "Strong background in condensed matter physics or quantum information",
        "Experience with cryogenic measurement techniques",
        "Familiarity with superconducting materials and devices",
        "Proficiency with data analysis (Python, MATLAB, or similar)",
        "Excellent publication record in top-tier physics journals",
        "Strong problem-solving and experimental design skills",
        "Ability to work independently and collaboratively",
        "Excellent written and oral communication abilities",
        "Nanofabrication or cleanroom experience highly desirable"
      ],
      "benefits": [
        "Competitive postdoc salary ($65K-$72K based on experience)",
        "Comprehensive health and dental insurance",
        "Retirement plan contributions",
        "Relocation assistance",
        "Access to world-class research facilities",
        "Conference travel support",
        "Professional development opportunities",
        "Collaborative, intellectually stimulating environment",
        "Opportunity to publish in high-impact journals"
      ],
      "salary_min": 65000,
      "salary_max": 72000,
      "pay_period": "Annual (2-year fixed-term appointment)",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 73,
      "company_name": "Blue Ridge Brewing Company",
      "company_description": "Blue Ridge Brewing is a craft brewery and taproom producing traditional and experimental beers. We distribute kegs and cans throughout the region and operate a popular taproom with food service.",
      "position_title": "Brewer",
      "job_type": "Full Time",
      "location": "On-site in Asheville, NC",
      "position_summary": "Blue Ridge Brewing seeks an experienced Brewer to produce high-quality craft beers on our 15-barrel system. You'll manage all aspects of the brewing process from recipe formulation to packaging.",
      "primary_responsibilities": [
        "Execute brew days from milling through fermentation",
        "Monitor fermentation and make adjustments as needed",
        "Transfer beer, add dry hops, and manage conditioning",
        "Operate canning line and keg filling equipment",
        "Maintain detailed brewing logs and quality records",
        "Clean and sanitize tanks, lines, and equipment",
        "Perform quality checks including pH, gravity, and sensory analysis",
        "Collaborate on recipe development and experimentation",
        "Manage yeast propagation and maintain yeast bank",
        "Order and manage brewing ingredients and supplies",
        "Troubleshoot brewing issues and implement solutions",
        "Maintain equipment and coordinate repairs"
      ],
      "requirements": [
        "2+ years of professional brewing experience on 7+ barrel system",
        "Brewing school certificate or equivalent hands-on experience",
        "Strong knowledge of brewing science, ingredients, and processes",
        "Experience with various beer styles (ales, lagers, sours)",
        "Understanding of quality control and sensory analysis",
        "Mechanical aptitude and problem-solving skills",
        "Physical ability to lift 165 lb kegs and work in wet conditions",
        "Attention to detail and commitment to consistency",
        "Ability to work early morning shifts (start times 6-7am)",
        "Forklift certification or willingness to obtain",
        "Passion for craft beer and brewing excellence"
      ],
      "benefits": [
        "Competitive salary",
        "Health insurance",
        "401(k) plan",
        "Paid time off",
        "Free beer (reasonable limits)",
        "Employee discounts on food and merchandise",
        "Opportunity to brew creative beers",
        "Supportive team environment",
        "Beautiful mountain location"
      ],
      "salary_min": 45000,
      "salary_max": 55000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 74,
      "company_name": "Nationwide Insurance Agency",
      "company_description": "Nationwide Insurance Agency is an independent agency representing multiple carriers for personal and commercial insurance. We've served the community for 40 years with personalized service and competitive rates.",
      "position_title": "Insurance Agent / Producer",
      "job_type": "Full Time",
      "location": "On-site in Omaha, NE",
      "position_summary": "Nationwide Agency seeks a licensed Insurance Agent to sell personal and commercial insurance products. You'll develop new business, service existing clients, and provide comprehensive coverage solutions.",
      "primary_responsibilities": [
        "Prospect for new clients through networking, referrals, and cold calling",
        "Quote and sell auto, home, life, and commercial insurance policies",
        "Conduct needs assessments and recommend appropriate coverage",
        "Prepare and present insurance proposals to prospects",
        "Service existing client base and handle policy changes",
        "Process applications and bind coverage with carriers",
        "Follow up on quotes and renewals to maximize closing ratio",
        "Build relationships with referral sources (realtors, mortgage brokers, etc.)",
        "Stay current on insurance products and coverage options",
        "Meet monthly sales goals and activity metrics",
        "Maintain accurate records in agency management system",
        "Provide excellent customer service and retain clients"
      ],
      "requirements": [
        "Property & Casualty insurance license required",
        "Life & Health license preferred or willingness to obtain",
        "2+ years of insurance sales experience preferred",
        "Strong sales and closing abilities",
        "Excellent communication and relationship-building skills",
        "Self-motivated with hunter mentality",
        "Knowledge of insurance products and coverages",
        "Ability to explain complex information clearly",
        "Proficiency with agency management systems",
        "Valid driver's license",
        "Professional appearance and demeanor"
      ],
      "benefits": [
        "Base salary plus commission (uncapped earning potential)",
        "Bonus opportunities for exceeding goals",
        "Health and dental insurance",
        "401(k) with match",
        "Paid time off",
        "Leads provided",
        "Training and professional development",
        "Supportive team environment",
        "Potential for agency ownership opportunity"
      ],
      "salary_min": 45000,
      "salary_max": 90000,
      "pay_period": "Annual (base + commission, top performers earn $80K-$120K+)",
      "relocation_required": null
    },
    {
      "id": 75,
      "company_name": "Urban Planning Associates",
      "company_description": "Urban Planning Associates is a consulting firm providing comprehensive planning, zoning, and community development services to municipalities, developers, and institutions. Our 30-person team works on projects throughout the Mid-Atlantic region.",
      "position_title": "Urban Planner",
      "job_type": "Full Time",
      "location": "Hybrid in Baltimore, MD (3 days in office)",
      "position_summary": "Urban Planning Associates seeks an Urban Planner to work on comprehensive plans, zoning ordinances, and development review projects. You'll conduct research, facilitate public engagement, and prepare planning documents.",
      "primary_responsibilities": [
        "Conduct research and analysis for comprehensive plans and studies",
        "Prepare planning documents, reports, and presentations",
        "Facilitate public meetings and stakeholder engagement sessions",
        "Review development applications for zoning compliance",
        "Draft zoning ordinances and land use regulations",
        "Create maps and graphics using GIS software",
        "Conduct site visits and document existing conditions",
        "Coordinate with municipal staff, elected officials, and consultants",
        "Present recommendations to planning commissions and governing bodies",
        "Manage project timelines and deliverables",
        "Support business development and proposal preparation",
        "Stay current on planning trends and best practices"
      ],
      "requirements": [
        "Master's degree in Urban Planning, City Planning, or related field",
        "AICP certification preferred or working toward",
        "2-4 years of planning experience in consulting or municipal government",
        "Strong knowledge of land use planning, zoning, and urban design principles",
        "Proficiency with GIS (ArcGIS) and Adobe Creative Suite",
        "Excellent research, writing, and analytical skills",
        "Experience facilitating public meetings and stakeholder engagement",
        "Strong communication and presentation abilities",
        "Ability to manage multiple projects simultaneously",
        "Valid driver's license for site visits",
        "Passion for sustainable, equitable community development"
      ],
      "benefits": [
	  "Competitive salary based on experience",
	  "Performance bonuses",
	  "Comprehensive health benefits",
	  "401(k) with match",
	  "Flexible hybrid schedule",
	  "Generous PTO",
	  "Professional development support",
	  "Licensure and membership dues paid",
	  "Collaborative work environment",
	  "Interesting variety of projects"
	]
	},
{
      "id": 76,
      "company_name": "Sunrise Home Health Services",
      "company_description": "Sunrise Home Health provides skilled nursing, therapy, and personal care services to patients in their homes. We serve a five-county area helping individuals recover from illness, manage chronic conditions, and age safely at home.",
      "position_title": "Home Health Nurse (RN)",
      "job_type": "Full Time",
      "location": "Field-based in Jacksonville, FL",
      "position_summary": "Sunrise Home Health seeks a compassionate RN to provide skilled nursing care to homebound patients. You'll assess patients, coordinate care plans, and deliver treatments in patients' homes throughout our service area.",
      "primary_responsibilities": [
        "Conduct comprehensive assessments of patients in their homes",
        "Develop and implement individualized care plans",
        "Provide skilled nursing interventions including wound care, IV therapy, and medication management",
        "Monitor patient progress and adjust care plans as needed",
        "Educate patients and caregivers on disease management and self-care",
        "Coordinate care with physicians, therapists, and other healthcare providers",
        "Document visits and maintain accurate medical records in EMR system",
        "Supervise home health aides as assigned",
        "Ensure compliance with Medicare regulations and agency policies",
        "Manage caseload of 20-25 patients",
        "Participate in on-call rotation"
      ],
      "requirements": [
        "Current Florida RN license",
        "Bachelor's degree in Nursing (BSN) preferred",
        "1+ years of clinical nursing experience; home health experience preferred",
        "Valid driver's license and reliable transportation",
        "Strong clinical assessment and critical thinking skills",
        "Excellent communication and patient education abilities",
        "Ability to work independently and manage time effectively",
        "Proficiency with EMR systems and mobile technology",
        "CPR certification",
        "Flexibility for occasional evening or weekend visits"
      ],
      "benefits": [
        "Competitive salary with mileage reimbursement",
        "Flexible schedule with no nights",
        "Comprehensive health benefits",
        "401(k) with match",
        "Generous PTO",
        "Company cell phone and tablet",
        "Continuing education support",
        "Rewarding work helping patients in their homes"
      ],
      "salary_min": 70000,
      "salary_max": 85000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 77,
      "company_name": "Premier Auto Group",
      "company_description": "Premier Auto Group operates five dealerships selling new and pre-owned vehicles from major manufacturers. We're a family-owned business committed to honest dealing and customer satisfaction for over 50 years.",
      "position_title": "Automotive Sales Consultant",
      "job_type": "Full Time",
      "location": "On-site in Tulsa, OK",
      "position_summary": "Premier Auto Group is hiring Sales Consultants to help customers find the right vehicle for their needs. You'll build relationships, demonstrate vehicles, and guide customers through the purchase process.",
      "primary_responsibilities": [
        "Greet customers and determine their vehicle needs and preferences",
        "Demonstrate vehicle features and conduct test drives",
        "Present financing options and negotiate deals",
        "Work with sales managers to structure deals and close sales",
        "Follow up with prospects and maintain contact database",
        "Meet monthly sales goals and activity metrics",
        "Maintain product knowledge on inventory and new models",
        "Ensure positive customer experience throughout sales process",
        "Complete all sales paperwork accurately",
        "Attend sales meetings and product training",
        "Participate in dealership events and promotions"
      ],
      "requirements": [
        "High school diploma or equivalent",
        "Previous sales experience preferred but not required",
        "Valid driver's license with clean driving record",
        "Strong interpersonal and communication skills",
        "Customer service-oriented with professional demeanor",
        "Self-motivated and goal-driven",
        "Ability to work flexible schedule including evenings and weekends",
        "Basic computer skills",
        "Enthusiasm for cars and helping customers",
        "Willingness to complete manufacturer training programs"
      ],
      "benefits": [
        "Commission-based compensation (average earnings $50K-$80K+)",
        "Monthly bonuses for exceeding goals",
        "Health insurance",
        "401(k) plan",
        "Demo vehicle program for top performers",
        "Paid training",
        "Employee vehicle purchase discounts",
        "Advancement opportunities",
        "Fun, competitive environment"
      ],
      "salary_min": 50000,
      "salary_max": 100000,
      "pay_period": "Annual (commission-based, earnings vary by performance)",
      "relocation_required": null
    },
    {
      "id": 78,
      "company_name": "TechBridge IT Solutions",
      "company_description": "TechBridge provides IT consulting, cloud migration, and cybersecurity services to mid-market companies. Our team of 75 consultants delivers transformation projects for clients across North America.",
      "position_title": "Cloud Solutions Architect",
      "job_type": "Full Time",
      "location": "Remote (US/Canada, 40% client travel)",
      "position_summary": "TechBridge seeks a Cloud Solutions Architect to design and implement cloud infrastructure for enterprise clients. You'll lead cloud migration projects, architect solutions on AWS/Azure, and serve as a trusted technical advisor.",
      "primary_responsibilities": [
        "Design cloud architecture solutions aligned with client business requirements",
        "Lead cloud migration assessments and develop migration strategies",
        "Architect multi-cloud and hybrid cloud environments",
        "Implement infrastructure as code using Terraform or CloudFormation",
        "Design for high availability, disaster recovery, and security",
        "Provide technical leadership on client engagements",
        "Conduct workshops and present architecture recommendations to stakeholders",
        "Develop cloud governance frameworks and best practices",
        "Mentor junior consultants and cloud engineers",
        "Stay current on cloud platform capabilities and emerging technologies",
        "Support pre-sales activities and solution proposals",
        "Travel to client sites approximately 40% of time"
      ],
      "requirements": [
        "Bachelor's degree in Computer Science or related field",
        "7+ years of experience in infrastructure/cloud architecture",
        "Deep expertise with AWS and/or Azure cloud platforms",
        "AWS Solutions Architect Professional or Azure Solutions Architect Expert certification required",
        "Strong experience with infrastructure as code (Terraform, CloudFormation)",
        "Knowledge of networking, security, and identity management in cloud",
        "Experience leading cloud migration projects",
        "Excellent client-facing and presentation skills",
        "Strong documentation and technical writing abilities",
        "Consulting or professional services experience required",
        "Willingness to travel extensively"
      ],
      "benefits": [
        "Competitive salary $130K-$165K",
        "Performance bonuses",
        "Remote work when not traveling",
        "Comprehensive health benefits",
        "401(k) with 6% match",
        "Unlimited PTO policy",
        "Certification and training budget ($5K annually)",
        "Travel rewards and status",
        "Home office equipment",
        "Collaborative consulting culture"
      ],
      "salary_min": 130000,
      "salary_max": 165000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 79,
      "company_name": "Mountain Adventures Outfitters",
      "company_description": "Mountain Adventures operates guided outdoor experiences including whitewater rafting, zip-lining, rock climbing, and hiking tours in the Rocky Mountains. We provide unforgettable adventures with a focus on safety and environmental stewardship.",
      "position_title": "Outdoor Adventure Guide",
      "job_type": "Seasonal Full Time",
      "location": "On-site in Estes Park, CO",
      "position_summary": "Mountain Adventures is hiring Adventure Guides for the summer season (May-September) to lead whitewater rafting trips and other outdoor activities. You'll ensure guest safety while creating memorable experiences in stunning mountain settings.",
      "primary_responsibilities": [
        "Lead whitewater rafting trips on Class II-IV rivers",
        "Guide zip-line tours and facilitate rock climbing activities",
        "Conduct pre-trip safety briefings and equipment fitting",
        "Demonstrate proper techniques and ensure guest safety",
        "Provide engaging interpretation of natural and cultural history",
        "Respond appropriately to emergencies and changing conditions",
        "Maintain and inspect equipment daily",
        "Provide excellent customer service and create positive experiences",
        "Transport guests to/from activity sites",
        "Assist with equipment loading/unloading",
        "Complete required paperwork and incident reports",
        "Participate in ongoing training and staff meetings"
      ],
      "requirements": [
        "Must be at least 18 years old",
        "Previous guiding experience preferred but not required",
        "Wilderness First Responder or EMT certification required (or complete during training)",
        "Swift water rescue certification preferred (training provided)",
        "Strong swimming ability and comfort in whitewater",
        "Physical fitness and ability to work outdoors in varying conditions",
        "Excellent communication and interpersonal skills",
        "Positive attitude and enthusiasm for outdoor recreation",
        "Valid driver's license with clean record",
        "Availability for entire season (May-September)",
        "Willingness to work weekends and holidays"
      ],
      "benefits": [
        "Competitive seasonal wage",
        "Tips from guests",
        "Free or discounted employee housing available",
        "Wilderness First Responder certification provided",
        "Free outdoor gear rental",
        "Staff adventure days",
        "Amazing workplace in the Rockies",
        "Opportunity to share passion for outdoors"
      ],
      "salary_min": 16.00,
      "salary_max": 20.00,
      "pay_period": "Hourly (plus tips)",
      "relocation_required": null
    },
    {
      "id": 80,
      "company_name": "Catalyst Venture Partners",
      "company_description": "Catalyst Venture Partners is an early-stage venture capital firm investing in B2B SaaS, fintech, and healthcare technology startups. We manage $400M across two funds and provide hands-on support to portfolio companies.",
      "position_title": "Venture Capital Analyst",
      "job_type": "Full Time",
      "location": "On-site in San Francisco, CA",
      "position_summary": "Catalyst seeks a highly analytical Venture Capital Analyst to source deals, conduct due diligence, and support portfolio companies. This role offers exposure to early-stage investing and startup ecosystems.",
      "primary_responsibilities": [
        "Source investment opportunities through networking, research, and inbound deal flow",
        "Conduct initial screening and analysis of potential investments",
        "Perform market research and competitive landscape analysis",
        "Build financial models and valuation analyses",
        "Conduct due diligence including management interviews and reference checks",
        "Prepare investment memos and presentations for partnership",
        "Track portfolio company metrics and support performance monitoring",
        "Attend pitch meetings and represent firm at startup events",
        "Support portfolio companies with introductions and operational assistance",
        "Maintain CRM system with deal pipeline and notes",
        "Research emerging technologies and market trends",
        "Coordinate with legal and finance on deal execution"
      ],
      "requirements": [
        "Bachelor's degree from top university in Business, Finance, Computer Science, or Engineering",
        "2-3 years of experience in investment banking, consulting, private equity, or high-growth startup",
        "Strong financial modeling and analytical skills",
        "Deep interest in technology and startups",
        "Excellent written and verbal communication abilities",
        "Ability to evaluate technical products and business models",
        "Self-starter with strong work ethic and attention to detail",
        "Networking skills and entrepreneurial mindset",
        "Proficiency with Excel, PowerPoint, and financial databases",
        "MBA or startup experience a plus but not required"
      ],
      "benefits": [
        "Competitive base salary $100K-$130K",
        "Performance bonus",
        "Carried interest participation in fund returns",
        "Comprehensive health benefits",
        "401(k) plan",
        "Generous PTO",
        "Professional development budget",
        "Access to premier startup ecosystem",
        "Mentorship from experienced investors",
        "Clear path to Principal/Partner roles"
      ],
      "salary_min": 100000,
      "salary_max": 130000,
      "pay_period": "Annual (plus bonus and carry)",
      "relocation_required": "Relocation assistance available"
    },
    {
      "id": 81,
      "company_name": "Westside Veterinary Clinic",
      "company_description": "Westside Veterinary Clinic is a companion animal practice providing comprehensive veterinary care including wellness, surgery, dentistry, and urgent care. Our compassionate team treats pets like family.",
      "position_title": "Veterinarian (DVM)",
      "job_type": "Full Time",
      "location": "On-site in Portland, OR",
      "position_summary": "Westside Veterinary Clinic seeks an experienced or new graduate Veterinarian to join our established practice. You'll provide high-quality medical and surgical care to dogs and cats in a supportive, well-equipped environment.",
      "primary_responsibilities": [
        "Perform physical examinations and diagnose medical conditions",
        "Develop treatment plans and communicate recommendations to clients",
        "Perform soft tissue surgeries including spays, neuters, and mass removals",
        "Conduct dental procedures and cleanings",
        "Interpret diagnostic tests including lab work, radiographs, and ultrasound",
        "Prescribe medications and treatments",
        "Provide compassionate end-of-life care and euthanasia services",
        "Mentor veterinary technicians and support staff",
        "Maintain accurate medical records in practice management software",
        "Participate in continuing education",
        "Build relationships with clients and provide excellent customer service"
      ],
      "requirements": [
        "Doctor of Veterinary Medicine (DVM) degree from accredited institution",
        "Active veterinary license in Oregon or ability to obtain",
        "New graduates welcome; mentorship provided",
        "Proficiency in small animal medicine and surgery",
        "Strong diagnostic and clinical skills",
        "Excellent communication and interpersonal abilities",
        "Compassionate approach with patients and clients",
        "Ability to work efficiently and handle varied caseload",
        "Team player with positive attitude",
        "Willingness to work some Saturdays (rotating schedule)",
        "DEA license"
      ],
      "benefits": [
        "Competitive salary $100K-$140K (ProSal formula)",
        "Production-based compensation potential",
        "Comprehensive health, dental, and vision insurance",
        "401(k) with match",
        "Generous PTO (4 weeks) plus paid holidays",
        "CE allowance ($3,000) and paid CE days",
        "Professional dues and licensure fees paid",
        "Employee pet care discount",
        "Mentorship and support for new graduates",
        "Modern equipment and supportive team",
        "No emergency or on-call"
      ],
      "salary_min": 100000,
      "salary_max": 140000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 82,
      "company_name": "Global Translations Inc",
      "company_description": "Global Translations provides professional translation and localization services in over 100 languages. We serve clients in legal, medical, technical, and marketing sectors with certified translators and rigorous quality processes.",
      "position_title": "Spanish-English Translator",
      "job_type": "Full Time - Remote",
      "location": "Remote (US-based)",
      "position_summary": "Global Translations seeks a professional Spanish-English Translator to translate documents across various subject areas. You'll provide accurate, culturally appropriate translations while meeting client deadlines and quality standards.",
      "primary_responsibilities": [
        "Translate documents from Spanish to English and English to Spanish",
        "Translate materials including legal documents, medical records, technical manuals, and marketing content",
        "Review and edit translations for accuracy, grammar, and style",
        "Research terminology and maintain translation memories",
        "Use CAT tools (SDL Trados, memoQ) to ensure consistency",
        "Collaborate with project managers on timelines and requirements",
        "Provide certified translations with notarization when required",
        "Conduct quality checks and proofreading",
        "Maintain confidentiality of client materials",
        "Meet project deadlines while maintaining quality standards",
        "Specialize in specific subject areas as appropriate"
      ],
      "requirements": [
        "Bachelor's degree in Translation, Languages, or related field",
        "Native or near-native proficiency in Spanish and English",
        "3+ years of professional translation experience",
        "ATA certification strongly preferred",
        "Proficiency with CAT tools (SDL Trados, memoQ, or similar)",
        "Excellent writing skills in both languages",
        "Knowledge of specialized terminology (legal, medical, or technical)",
        "Strong attention to detail and commitment to quality",
        "Ability to manage multiple projects and meet deadlines",
        "Cultural awareness and sensitivity",
        "Reliable home office setup with high-speed internet"
      ],
      "benefits": [
        "Competitive per-word rates or annual salary option",
        "100% remote work with flexible hours",
        "Health insurance stipend",
        "Consistent workflow from diverse clients",
        "Professional development and certification support",
        "Latest CAT tools and technology provided",
        "Collaborative team environment",
        "Opportunity to specialize in preferred subject areas"
      ],
      "salary_min": 55000,
      "salary_max": 75000,
      "pay_period": "Annual or per-word",
      "relocation_required": null
    },
    {
      "id": 83,
      "company_name": "Riverside Manufacturing",
      "company_description": "Riverside Manufacturing produces custom metal fabrications and assemblies for industrial equipment manufacturers. Our 80,000 sq ft facility houses welding, machining, and assembly operations serving clients nationwide.",
      "position_title": "Production Supervisor",
      "job_type": "Full Time",
      "location": "On-site in Green Bay, WI",
      "position_summary": "Riverside Manufacturing seeks a Production Supervisor to oversee welding and fabrication operations on 2nd shift. You'll lead a team of 20 production workers ensuring safety, quality, productivity, and on-time delivery.",
      "primary_responsibilities": [
        "Supervise 2nd shift production team of welders, fabricators, and assemblers",
        "Plan and coordinate daily production activities to meet schedules",
        "Monitor production output, quality, and efficiency metrics",
        "Ensure compliance with safety regulations and company policies",
        "Train employees on equipment operation and work procedures",
        "Conduct performance evaluations and address employee issues",
        "Troubleshoot production problems and implement solutions",
        "Coordinate with other shifts and departments on workflow",
        "Maintain accurate production records and reports",
        "Participate in continuous improvement initiatives",
        "Manage overtime and attendance",
        "Enforce quality standards and conduct inspections"
      ],
      "requirements": [
        "High school diploma or equivalent; Associate degree preferred",
        "5+ years of manufacturing experience with 2+ years in supervisory role",
        "Knowledge of welding, fabrication, and metal working processes",
        "Strong leadership and people management skills",
        "Understanding of lean manufacturing principles",
        "Ability to read blueprints and technical drawings",
        "Proficiency with production planning and ERP systems",
        "Excellent problem-solving and decision-making abilities",
        "Strong communication skills at all organizational levels",
        "Forklift and overhead crane certification preferred",
        "Flexibility to work 2nd shift (2:30pm-11:00pm)"
      ],
      "benefits": [
        "Competitive salary",
        "Shift differential",
        "Comprehensive health benefits",
        "401(k) with company match",
        "Paid time off and holidays",
        "Annual bonus potential",
        "Professional development opportunities",
        "Stable manufacturing company",
        "Advancement opportunities"
      ],
      "salary_min": 65000,
      "salary_max": 78000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 84,
      "company_name": "Bright Start Early Intervention",
      "company_description": "Bright Start provides early intervention services to infants and toddlers with developmental delays. Our multidisciplinary team delivers evidence-based therapies in natural environments including homes and childcare settings.",
      "position_title": "Early Intervention Specialist",
      "job_type": "Full Time",
      "location": "Field-based in Columbus, OH",
      "position_summary": "Bright Start seeks an Early Intervention Specialist to provide developmental services to children birth to age 3 and support their families. You'll work in homes and community settings using family-centered practices.",
      "primary_responsibilities": [
        "Conduct developmental assessments and evaluations",
        "Develop and implement Individualized Family Service Plans (IFSPs)",
        "Provide coaching and strategies to families in natural environments",
        "Address developmental needs across all domains (cognitive, motor, communication, social-emotional, adaptive)",
        "Collaborate with multidisciplinary team including therapists and service coordinators",
        "Document services and maintain accurate records in data system",
        "Facilitate family participation and build on family strengths",
        "Transition children to preschool services at age 3",
        "Travel to homes and childcare centers throughout service area",
        "Participate in team meetings and professional development",
        "Maintain flexible caseload of 25-30 families"
      ],
      "requirements": [
        "Bachelor's degree in Early Childhood Education, Special Education, or related field; Master's preferred",
        "Early Intervention credential or willingness to obtain",
        "Experience working with infants/toddlers with developmental delays",
        "Knowledge of child development and evidence-based practices",
        "Strong family engagement and coaching skills",
        "Excellent communication and interpersonal abilities",
        "Cultural competence and ability to work with diverse families",
        "Valid driver's license and reliable transportation",
        "Flexibility for early morning and evening appointments",
        "CPR and First Aid certification"
      ],
      "benefits": [
        "Competitive salary",
        "Mileage reimbursement",
        "Health and dental insurance",
        "403(b) retirement plan",
        "Generous PTO",
        "Flexible scheduling",
        "Professional development and credentialing support",
        "Collaborative team environment",
        "Meaningful work with families"
      ],
      "salary_min": 45000,
      "salary_max": 58000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 85,
      "company_name": "Apex Financial Services",
      "company_description": "Apex Financial Services is a regional accounting and business advisory firm serving closely-held businesses and their owners. Our 60-person team provides tax, accounting, consulting, and wealth management services.",
      "position_title": "Staff Accountant",
      "job_type": "Full Time",
      "location": "Hybrid in Richmond, VA (2-3 days in office)",
      "position_summary": "Apex Financial seeks a Staff Accountant to support our accounting and tax teams. You'll prepare financial statements, assist with tax returns, and gain exposure to diverse clients while developing your technical skills.",
      "primary_responsibilities": [
        "Prepare monthly, quarterly, and annual financial statements",
        "Assist with business and individual tax return preparation",
        "Perform bookkeeping and accounting services for small business clients",
        "Reconcile accounts and analyze financial data",
        "Assist with payroll processing and sales tax filings",
        "Communicate with clients regarding financial information and questions",
        "Support senior staff on consulting engagements",
        "Maintain organized client files and documentation",
        "Use accounting software (QuickBooks, Xero, etc.) and tax software",
        "Research accounting and tax issues as needed",
        "Meet deadlines during tax season and month-end close periods"
      ],
      "requirements": [
        "Bachelor's degree in Accounting required",
        "0-2 years of accounting experience; recent graduates welcome",
        "Strong understanding of accounting principles and financial statements",
        "Knowledge of tax concepts helpful but not required",
        "Proficiency with Microsoft Excel",
        "Detail-oriented with strong analytical skills",
        "Excellent organizational and time management abilities",
        "Strong written and verbal communication skills",
        "Ability to work independently and as part of team",
        "CPA candidate or pursuing CPA license preferred",
        "Willingness to work overtime during busy season"
      ],
      "benefits": [
        "Competitive starting salary",
        "Hybrid work flexibility (outside busy season)",
        "Health and dental insurance",
        "401(k) with match",
        "PTO and paid holidays",
        "CPA exam review course and fees paid",
        "Continuing education support",
        "Mentorship and career development",
        "Business casual dress code",
        "Clear advancement path"
      ],
      "salary_min": 52000,
      "salary_max": 62000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 86,
      "company_name": "Pacific Coast Hotel",
      "company_description": "Pacific Coast Hotel is an upscale 200-room beachfront property offering luxurious accommodations, fine dining, spa services, and event spaces. We're committed to delivering exceptional guest experiences and Southern California hospitality.",
      "position_title": "Front Desk Manager",
      "job_type": "Full Time",
      "location": "On-site in Santa Barbara, CA",
      "position_summary": "Pacific Coast Hotel seeks a Front Desk Manager to oversee front office operations and lead our guest services team. You'll ensure smooth check-in/out processes, handle VIP guests, and maintain our reputation for outstanding service.",
      "primary_responsibilities": [
        "Oversee daily front desk operations and guest services",
        "Lead, train, and schedule front desk team of 12 staff members",
        "Ensure efficient check-in/check-out and exceptional guest service",
        "Handle guest complaints and resolve issues promptly",
        "Manage room inventory and optimize occupancy through upselling",
        "Coordinate with housekeeping on room status and availability",
        "Process reservations and manage group blocks",
        "Oversee VIP guest arrivals and special requests",
        "Monitor front desk performance metrics and implement improvements",
        "Conduct staff meetings and performance evaluations",
        "Maintain knowledge of hotel services, local attractions, and events",
        "Ensure compliance with brand standards and hotel policies",
        "Manage front desk budget and control costs",
        "Work flexible schedule including evenings, weekends, and holidays"
      ],
      "requirements": [
        "Bachelor's degree in Hospitality Management or related field preferred",
        "3-5 years of hotel front desk experience with 1-2 years in supervisory role",
        "Strong knowledge of hotel operations and property management systems (Opera preferred)",
        "Excellent customer service and problem-solving skills",
        "Strong leadership and team development abilities",
        "Professional appearance and demeanor",
        "Outstanding communication skills",
        "Ability to remain calm under pressure",
        "Proficiency with Microsoft Office",
        "Bilingual (English/Spanish) a plus",
        "Flexibility to work varied shifts including weekends"
      ],
      "benefits": [
        "Competitive salary",
        "Performance bonuses",
        "Comprehensive health benefits",
        "401(k) plan",
        "Paid time off",
        "Hotel discounts worldwide",
        "Employee dining privileges",
        "Professional development opportunities",
        "Beautiful beachfront workplace"
      ],
      "salary_min": 55000,
      "salary_max": 68000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 87,
      "company_name": "Green Energy Consultants",
      "company_description": "Green Energy Consultants provides energy auditing, renewable energy design, and sustainability consulting services to commercial and institutional clients. We help organizations reduce energy costs and environmental impact.",
      "position_title": "Energy Analyst",
      "job_type": "Full Time",
      "location": "Hybrid in Boulder, CO (2 days in office)",
      "position_summary": "Green Energy Consultants seeks an Energy Analyst to conduct energy audits, perform modeling, and develop recommendations for building efficiency improvements. You'll work on diverse projects helping clients achieve sustainability goals.",
      "primary_responsibilities": [
        "Conduct energy audits of commercial and institutional buildings",
        "Collect and analyze utility data and building performance metrics",
        "Perform energy modeling using software (eQUEST, EnergyPlus, or similar)",
        "Identify energy conservation measures and calculate savings",
        "Prepare detailed audit reports with recommendations and financial analysis",
        "Design renewable energy systems (solar PV, geothermal)",
        "Support LEED certification and green building projects",
        "Present findings and recommendations to clients",
        "Research utility incentive programs and rebates",
        "Conduct site visits and collect field data",
        "Stay current on energy codes, standards, and technologies"
      ],
      "requirements": [
        "Bachelor's degree in Engineering, Environmental Science, or related field",
        "2-4 years of energy analysis or building science experience",
        "Proficiency with energy modeling software (eQUEST, EnergyPlus, REM/Rate)",
        "Understanding of HVAC systems, building envelope, and lighting",
        "Knowledge of renewable energy technologies",
        "Strong analytical and problem-solving skills",
        "Excellent technical writing and communication abilities",
        "Certified Energy Manager (CEM) or LEED AP preferred",
        "Proficiency with Microsoft Excel and data analysis",
        "Valid driver's license for site visits",
        "Passion for sustainability and energy efficiency"
      ],
      "benefits": [
        "Competitive salary",
        "Performance bonuses",
        "Health and dental insurance",
        "401(k) with match",
        "Flexible hybrid schedule",
        "Generous PTO",
        "Professional development and certification support",
        "Bike commuter benefits",
        "Mission-driven work environment",
        "Interesting variety of projects"
      ],
      "salary_min": 65000,
      "salary_max": 80000,
      "pay_period": "Annual",
      "relocation_required": null
    },
    {
      "id": 88,
      "company_name": "Metro City Zoo",
      "company_description": "Metro City Zoo is an AZA-accredited zoological park housing over 2,000 animals representing 400 species. We're dedicated to conservation, education, and providing exceptional care for animals while inspiring visitors to protect wildlife.",
      "position_title": "Zookeeper - Large Mammals",
      "job_type": "Full Time",
      "location": "On-site in San Diego, CA",
      "position_summary": "Metro City Zoo seeks an experienced Zookeeper for our Large Mammal department including elephants, rhinos, giraffes, and big cats. You'll provide daily care, enrichment, training, and contribute to conservation efforts.",
      "primary_responsibilities": [
        "Provide daily care for large mammals including feeding, cleaning, and observation",
        "Prepare diets according to nutritional plans",
        "Monitor animal health and behavior; report concerns to veterinary staff",
        "Implement enrichment programs to promote natural behaviors",
        "Participate in operant conditioning training programs",
        "Maintain clean and safe exhibits and holding areas",
        "Interact with zoo visitors and provide educational information",
        "Maintain detailed records of animal care and observations",
        "Assist with veterinary procedures and exams",
        "Participate in conservation and breeding programs",
        "Follow all safety protocols when working with dangerous animals",
        "Work weekends, holidays, and varied shifts as scheduled"
      ],
      "requirements": [
        "Bachelor's degree in Zoology, Animal Science, or related field",
        "2+ years of professional zookeeping experience with large mammals",
        "Knowledge of large mammal husbandry, behavior, and training",
        "Experience with protected contact or free contact elephant management preferred",
        "Physical ability to perform demanding work in all weather conditions",
        "Ability to lift 50 lbs and work on uneven terrain",
        "Strong observation and animal assessment skills",
        "Excellent communication and teamwork abilities",
        "Commitment to animal welfare and conservation",
        "Valid driver's license",
		"Flexibility to work weekends"
      ],
      "salary_min": 90000,
      "salary_max": 120000,
      "pay_period": "Annual",
      "relocation_required": null
    }
]
